[
  {
    "web-scraper-order": "1752845483-1",
    "web-scraper-start-url": "https://www.airbus.com/en/careers/students-and-graduates/graduates",
    "role-name": "",
    "role-description": "The Airbus Global Graduate Programme (AGGP) seeks graduates to join teams around the world.",
    "role-status": "Applications for AGGP are now closed, reopening in September 2025",
    "apply-button": "Browse all open positions",
    "apply-button-href": "https://ag.wd3.myworkdayjobs.com/en-US/Airbus",
    "source": "airbus-grads"
  },
  {
    "web-scraper-order": "1752845459-1",
    "web-scraper-start-url": "https://careers.db.com/students-graduates/Search-Programmes/#/graduate/results/?program=10",
    "programme-page": "",
    "programme-page-href": "",
    "name": "",
    "location": "",
    "description": "",
    "apply-link": "",
    "apply-link-href": "",
    "source": "DEUTSCHE-BANK-GRADS"
  },
  {
    "web-scraper-order": "1752845460-1",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Summer Internships",
    "role-duration": "Duration: 10-Weeks\nLocation: London Heathrow\nRequirement: First or second year student when completing the internship. Minimum predicted 2:2 degree, or equivalent in any subject.\nSalary: £24,200 Pro Rata\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nIt may only last the summer, but we’ll pack plenty in. Take on responsibility in one of a variety of placements in our head office departments and beyond. You’ll complete projects, business as usual tasks and activities that make a real difference to our business, all while working alongside knowledgeable colleagues who’ll guide and support you. You’ll have plenty of opportunities to build your network with the Graduate community and learn about other areas of the airline too. We’ve always been interested in different perspectives and viewpoints. Fresh thinking and new ideas. So we encourage applicants from any degree discipline.",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-2",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Future Leader Business Placements",
    "role-duration": "Duration: 11-Months\nLocation: London Heathrow and Barry, Wales\nRequirements: Second-year student for third-year Industrial Placement, sandwich degree.\nSalary: £22,400 - £24,200 Pro Rata, depending on location.\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nOver the course of this 11-month placement, you’ll develop an enviable set of skills through exposure to different business areas across the airline, in our head office and beyond, and involvement on various significant projects. We’re open to your fresh ideas and different perspectives. You’ll be asked to challenge our current thinking and look for ways to improve on existing processes – you could genuinely make us work faster, and smarter.",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-3",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Commercial Business",
    "role-duration": "Duration: 3 Years\nLocation: London Heathrow\nRequirements: Minimum 2:2 degree or equivalent, in any subject (either achieved or expected).\nSalary: £33,600\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nOver 3 years, you’ll complete 3 very different and unique roles across our Commercial departments with the aim of developing you to become a commercial expert and leader of the future.",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-4",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Commercial Analytics",
    "role-duration": "Duration: 2 Years\nLocation: London Heathrow\nRequirements: Minimum 2:2 degree or equivalent, in any subject but ideally involving numbers and analysis (either achieved or expected).\nSalary: £33,600\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nYou’ll be responsible for change that you'll be able to see in our airports, with our aircraft and to when and where we fly. Or with our marketing communications, on our customer website, in our supplier and partner relationships and in our passenger numbers. Ultimately, in the exemplary customer experience, you help us to deliver. The placements you may experience in our area include Commercial Analytics where you’ll be working hand in hand with our front-line Global Sales team, so we can improve revenue and market share and understanding how we get our products in front of our customers and how our customers pay for them, or our Network Analytics team where you’ll plan our network, schedules, fleet, airport slot portfolio and more.",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-5",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Data Science",
    "role-duration": "Duration: 2 Years\nLocation: London Heathrow\nRequirements: Minimum 2:2 degree or equivalent, in a subject with significant Numerical / Data Science / Advanced Analytics / Applied Statistics / Computer Science content (either achieved or expected), and a minimum of grade B at A-Level Maths or equivalent.\nSalary: £35,200\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nAirlines are complex, everchanging and data rich, which means that the industry provides one of the most varied and interesting places for data and analytics professionals to work. Problems like determining the optimal mix of aircraft to buy for the next 20 years, or how to improve overbooking set up, requires a creative approach identifying and exploiting value from current and new data sources, applying advanced analytical techniques and visualisations.  You will provide the analytics, recommendations, tools and models to input into key business projects which cover all aspects of the airline. You’ll have a big impact on the profitability, sustainability and customer satisfaction of our company by increasing revenue, reducing costs, helping to manage risks and optimising our customer experience.",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-6",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Digital",
    "role-duration": "Duration: 2 Years\nLocation: London Heathrow\nRequirements: Minimum 2:2 degree or equivalent, in any subject (either achieved or expected).\nSalary: £35,000\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nImagine leading a team of engineers, driving the future of airline technology, or managing cutting-edge digital systems that keep our global operations seamless. How would it sound to oversee the integration of AI in baggage handling at Heathrow? Or perhaps develop innovative software solutions that improve the customer experience, opening up exciting new markets? Picture yourself influencing the technology roadmap that will shape our airline’s digital transformation over the next 20 years. Your placements and experiences will expose you to the breadth and depth of challenges only an airline our size can provide. This will give you big-picture understanding and foresight of what it takes to begin introducing innovations and leading positive change. You’ll also gain the essential and transferable skills needed to be a high performing leader.",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-7",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Finance",
    "role-duration": "Duration: 3 Years\nLocation: London Heathrow\nRequirements: Minimum 2:2 degree or equivalent, in any subject (either achieved or expected).\nSalary: £33,500\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nYou’ll make the most of your three years via three rotating placements, experiencing different ideas and projects across the business – all while building your network along the way and business partnering critical areas of the British Airways business. You could be influencing investment decisions on our onboard products, analysing commercial decisions on network growth opportunities, or negotiating with our vast supplier network to maintain cost competitiveness. We have influential Finance teams sitting in every department. You’ll quickly become an invaluable asset within any team, experiencing the breadth and depth of opportunities that only one of the world's biggest and best-known airlines can provide. We’ll also sponsor and support you to gain your preferred professional finance qualification – CIMA, ACCA or ACA (ICAEW).",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-8",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Future Leaders",
    "role-duration": "Duration: 3 Years\nLocation: London Heathrow\nRequirements: Minimum 2:2 degree or equivalent, in any subject (either achieved or expected).\nSalary: £33,000\nApplications: Opening in 2025",
    "role-about": "About the scheme:\nThrough a series of placements, you will get stuck in to the day-to-day tasks of running our business, as well as contributing to our long-term strategic vision and success. This is a hands-on programme in which you'll step out of your comfort zone, constructively challenge others and make your ideas reality.  Imagine leading a group of 75 cabin crew, or escorting the media on overseas trips as a PR Manager. How would it sound to run the ground staff at Heathrow? How about developing sales strategies for exciting new markets, or even influencing what our fleet should look like in 20 years’ time?",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-9",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Operations Planning",
    "role-duration": "Duration: 2 Years\nLocation: London Heathrow\nRequirements: Minimum 2:2 degree or equivalent, in any subject (either achieved or expected).\nSalary: £33,000\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nAcross the programme you will have the opportunity to experience different aspects of the planning and resource functions for our global airline. You will work in a directorate that has a direct impact on the British Airways operation. You will learn and apply new skills in Workforce planning and deployment, Post operational analysis, Stakeholder relationship management, People and change management and Continuous improvement. These placements will develop your ability to work with a range of people from different business areas, using a variety of technologies, methods, and measures to meet changing business needs.",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-10",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Engineering Technical",
    "role-duration": "Duration: 2 Years\nLocation: London Heathrow\nRequirements: Minimum 2:2 degree or equivalent, in a discipline involving mechanical or aeronautical engineering (either achieved or expected).\nSalary: £35,200\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nBeing part of our technical team in engineering means one thing: you’ll be at the heart of ensuring our aircraft are safe and reliable. With a fleet of over 250 aircraft, you’ll find yourself tackling a mix of new and old technology on our aircraft. You could be influencing the roll out of our new business class seats; inspecting a new aircraft after delivery; or being part of our largest cabin design for the new Boeing 777-X. You will apply your technical knowledge to make a tangible impact on the airline as your recommendations will drive key business decisions and your projects will deliver reliable aircraft that is leading edge to keep our aircraft flying for the longest timespan.",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752845460-11",
    "web-scraper-start-url": "https://careers.ba.com/graduates-bps-and-interns",
    "role-title": "Engineering Planning & Supply Chain",
    "role-duration": "Duration: 2 Years\nLocation: London Heathrow\nRequirements: Minimum 2:2 degree or equivalent, in any subject (either achieved or expected).\nSalary: £35,200\nApplications: Closed for 2024. Please revisit us in Autumn 2025.",
    "role-about": "About the scheme:\nThrough a series of placements, you’ll get under the skin of the strategic planning that makes our engineering function tick. With a large fleet of over 250 aircraft, you’ll have a breadth of exposure to our incredible operation. A big challenge of the role is managing the huge volumes of suppliers we work with to ensure we have the right parts in the right place at the right time, anywhere in the world enabling the smooth running of our operation. You could be organising the maintenance schedules for both our short haul and long haul aircraft; developing the long term strategy of maintenance considering efficiency, cost, time and quality of how we do things; or delivering projects around which aircraft we are entering and exiting in the business.",
    "source": "Bristishariways-grads"
  },
  {
    "web-scraper-order": "1752827957-1",
    "web-scraper-start-url": "https://www.amazon.jobs/en/search?offset=0&result_limit=10&sort=relevant&country%5B%5D=GBR&distanceType=Mi&radius=24km&industry_experience=less_than_1_year&latitude=&longitude=&loc_group_id=&loc_query=&base_query=graduate&city=&country=&region=&county=&query_options=&",
    "programme-page": "Graduate Devops Engineer, AWS",
    "programme-page-href": "https://www.amazon.jobs/en/jobs/2709979/graduate-devops-engineer-aws",
    "role-title": "Graduate Devops Engineer, AWS",
    "role-location": "GBR, POST-BER, Thames Valley",
    "role-description": "Graduate Devops Engineer, AWSJob ID: 2709979 | AWS EMEA SARL (UK Branch)",
    "apply-button": "Apply now",
    "apply-button-href": "https://www.amazon.jobs/applicant/jobs/2709979/apply",
    "source": "amazon-grads"
  },
  {
    "web-scraper-order": "1752827960-2",
    "web-scraper-start-url": "https://www.amazon.jobs/en/search?offset=0&result_limit=10&sort=relevant&country%5B%5D=GBR&distanceType=Mi&radius=24km&industry_experience=less_than_1_year&latitude=&longitude=&loc_group_id=&loc_query=&base_query=graduate&city=&country=&region=&county=&query_options=&",
    "programme-page": "Graduate Cloud Support Associate, Support Engineering",
    "programme-page-href": "https://www.amazon.jobs/en/jobs/3029359/graduate-cloud-support-associate-support-engineering",
    "role-title": "Graduate Cloud Support Associate, Support Engineering",
    "role-location": "GBR, POST-BER, Thames Valley",
    "role-description": "Graduate Cloud Support Associate, Support EngineeringJob ID: 3029359 | AWS EMEA SARL (UK Branch)",
    "apply-button": "Apply now",
    "apply-button-href": "https://www.amazon.jobs/applicant/jobs/3029359/apply",
    "source": "amazon-grads"
  },
  {
    "web-scraper-order": "1752827964-3",
    "web-scraper-start-url": "https://www.amazon.jobs/en/search?offset=0&result_limit=10&sort=relevant&country%5B%5D=GBR&distanceType=Mi&radius=24km&industry_experience=less_than_1_year&latitude=&longitude=&loc_group_id=&loc_query=&base_query=graduate&city=&country=&region=&county=&query_options=&",
    "programme-page": "2025 Graduate Software Dev Engineer",
    "programme-page-href": "https://www.amazon.jobs/en/jobs/2804113/2025-graduate-software-dev-engineer",
    "role-title": "2025 Graduate Software Dev Engineer",
    "role-location": "GBR, BST, Bristol",
    "role-description": "2025 Graduate Software Dev Engineer Job ID: 2804113 | Amazon UK Services Ltd.",
    "apply-button": "Apply now",
    "apply-button-href": "https://www.amazon.jobs/applicant/jobs/2804113/apply",
    "source": "amazon-grads"
  },
  {
    "web-scraper-order": "1752827994-1",
    "web-scraper-start-url": "https://jobs.aon.com/jobs?sortBy=relevance&page=1&keywords=%23AonGraduateUK%20",
    "programme-page": "Graduate Trainee – Captive & Insurance Management (Guernsey)",
    "programme-page-href": "https://jobs.aon.com/jobs/88028?lang=en-us&previousLocale=en-US",
    "role-name": "Graduate Trainee – Captive & Insurance Management (Guernsey)",
    "role-location": "St. Peter Port , Guernsey",
    "Job-description": "Job Description Graduate Trainee – Captive & Insurance Management (Guernsey) Have you achieved or on track to achieve a 2:1 degree?Are you ready to kick-start your career within the Captive Insurance Industry? If so, this might be the role for you! This is a permanent, full-time, role based in our Guernsey office.Start Date: September 2025Aon is in the business of better decisionsAt Aon, we shape decisions for the better to protect and enrich the lives of people around the world. As an organization, we are united through trust as one inclusive, diverse team, and we are passionate about helping our colleagues and clients succeed.What the day will look likeAssist in the preparation of all insurance related matters for client Board packs and strategy meetings. Support of, or presentation of insurance related matters to client Directors at Board Meetings and/or strategy meetingsEnsure all documentation, correspondence and telephone calls are dealt with professionally, efficiently, and accurately.Development of sound business relations with client staff responsible for insurance related mattersMaintaining an electronic filing system for each client assigned, ensuring all documents are filed in accordance with procedures manuals on a timely basis. Ensure a suitable archiving policy is being followed and all archiving is clearly labelled.Interaction with various people in a professional mannerMonitor the renewal deadlines for allocated clients and be proactive in starting renewal processAssist with re/insurance contract and reinsurance trust agreement wording reviews for new and renewing businessAssist with the maintenance of deal monitor and collateral tracking systems for ILS clients including but not limited to inputting data from reinsurance contracts, extracting usable information and manipulating data for the benefit of our clientsMonitoring and chasing premiums receipts, reinsurance recoveries, commissions and brokerage paymentsReceive and review claims bordereaux and other loss information received from brokers. Preparation of claims authorisation formsConsideration of current and existing client insurance programmes and development thereof. Ensure clients are kept abreast of all relevant information in connection with Aon, ACSG and the insurance markets worldwideWork closely with team colleagues on a proactive basis toward achieving both Aon Impact Model and client goalsDay to day insurance administration and assistance with underwriting and claims functions of a range of insurance licensed vehicles to ensure that office and client business strategies, plans and insurance programme placements are achieved, and that administration excellence is provided to clients. The role will be varied, and the successful candidate will gain invaluable re/insurance and ILS expertise which will allow for excellent career progression in the industry.Your DevelopmentAs an Aon Graduate, you will be enrolled onto our Launch Programme when you join. This development programme is built around 2 core elements:Business learning – on-the-job learning and experiences giving you the opportunity to develop your knowledge and understanding of the team and solution line you have joined.Centralised learning - UK graduates complete in an Aon Induction, monthly webinars, business skills training and workshops; all designed to help you develop your knowledge of Aon, build your confidence and your network across our business.Your career beyond your Graduate programmeOnce you’ve completed the formal graduate programme, you’ll continue to receive lots of support at Aon. As well as continued technical and business skills training, you’ll receive support for your PMI qualification. To aid your professional development you’ll receive regular performance feedback, and work with your line manager towards promotions, which are considered twice a year, enabling you to progress from a graduate, to Associate Consultant, then Consultant and beyond!How this opportunity is differentThe Aon Guernsey Graduate Programme offers an opportunity for a graduate to commence their career within the insurance sector at a leading manager of captive insurance companies and insurance related vehicles.  The role will be varied with the successful candidates gaining invaluable re/insurance and Insurance Linked Securities expertise which will allow for excellent career progression in the industry.  Over the 18-month programme, the successful candidate will spend time in all sections, gaining an insight into the business as a whole.Entry Requirements:You will need to have or be on track to achieve a 2:1 degree (or equivalent) in any degree subject areaOur Graduates are on permanent contracts from day one, so applicants for this programme must be eligible to work in Guernsey without the need for visa sponsorship now or in the future.  While UK & EU passport holders can reside in Guernsey, they will need to obtain a Population Management Permit or Certificate from the Guernsey Border Agency. See here for more information on this: https://gov.gg/pmfaq.   This is a key requirement of the role.What are we looking for?Motivation and ambition – you will need to be able to articulate why you want to join the Client Management programmePassionate about going above and beyond for clients, understanding of the value of customer service, teamwork and an enthusiastic approachCommercial awareness – this helps us to provide support and advice to our clients with clarity and confidenceExperience within a similar administrative role would be beneficial but not essentialWorking knowledge of MS Word, Excel and Outlook – desirableWe recognise the value for our Early Career colleagues of being in the office environment from the start of their programme. As a new graduate, you will spend the first 6 months based in the office to support your learning, development, and progression. This will enable you access to support from managers, collaborate with colleagues as well as grow your network across Aon. How we support our colleagues In addition to our comprehensive benefits package, we encourage a diverse workforce. Plus, our agile, inclusive environment allows you to manage your wellbeing and work/life balance, ensuring you can be your best self at Aon. Furthermore, all colleagues enjoy two “Global Wellbeing Days” each year, encouraging you to take time to focus on yourself.  We offer a variety of working style solutions, but we also recognise that flexibility goes beyond just the place of work... and we are all for it. We call this Smart Working!Our continuous learning culture inspires and equips you to learn, share and grow, helping you achieve your fullest potential. As a result, at Aon, you are more connected, more relevant, and more valued.We provide individuals with disabilities reasonable accommodations to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment in accordance with applicable law. Please contact us to request an accommodation on ReasonableAdjustments@Aon.comAon values an innovative, diverse workplace where all colleagues feel empowered to be their authentic selves. Aon is proud to be an equal opportunity workplace.  Aon values an innovative, diverse workplace where all colleagues feel empowered to be their authentic selves. Aon is proud to be an equal opportunity workplace.Next StepsIf you are interested in this graduate programme please click Apply.#AonGraduateUK#EMEAGraduate 2560174",
    "apply-button": "Apply",
    "apply-button-href": "https://english-careers-aon.icims.com/jobs/88028/login",
    "source": "AON-grads"
  },
  {
    "web-scraper-order": "1752827925-1",
    "web-scraper-start-url": "https://www.aldirecruitment.co.uk/early-careers/graduate-programme",
    "role-title": "Aldi Area Manager Graduate Programme",
    "role-requirements": "96 UCAS POINTS OR 63 SCOTTISH HIGHERS (OR EQUIVALENT ON THE OLD TARIFF) FROM YOUR TOP 3 A-LEVELS/SCOTTISH HIGHERS (OR THE EQUIVALENT FROM OTHER RELEVANT QUALIFICATIONS)\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\nA 2:1 DEGREE IN ANY DISCIPLINE\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\nA DRIVING LICENCE\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\nTHE RIGHT TO WORK IN THE UK",
    "roledescription": "You’ve probably heard a lot about the Aldi Area Manager Graduate Programme by now - and if you’ve not then you’ve come to the right place. We want our graduates to bring the best version of themselves and in return we’ll reward them with a fantastic package - and the rumours are true, it includes a fully expensed car!\n\nIt requires dedication and determination but the results are so rewarding - whether that’s through your professional development, your growth as an individual or seeing your store teams thrive (and it’ll be your responsibility to inspire them!).\n\nThroughout the year, you’ll learn the ins and outs of store life, before discovering what it takes to lead a group of £multi-million businesses. Afterwards? Well, it could be just the start of an exciting career full of amazing opportunities.",
    "role-salary": "£50,750 starting salary",
    "role-status": "CLOSED",
    "source": "aldi-grads"
  },
  {
    "web-scraper-order": "1752759725-1",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/86556420706575046-software-engineer-ii-ios-tracking-experiences?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Software Engineer II, iOS, Tracking Experiences",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n1 year of experience with data structures or algorithms.\n1 year of experience with iOS application development.\n\nPreferred qualifications:\nExperience working with Swift.\nExperience working with Objective-C.",
    "about-role": "About the jobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nThe Platforms and Devices team encompasses Google's various computing software platforms across environments (desktop, mobile, applications), as well as our first party devices and services that combine the best of Google AI, software, and hardware. Teams across this area research, design, and develop new technologies to make our user's interaction with computing faster and more seamless, building innovative experiences for our users around the world.",
    "responsibiltities": "Responsibilities\nDevelop robust, high-volume, production applications with quality, including implementing unit and integration tests as well as embody software architecture best practices.\nDesign, develop, test, deploy, maintain, document and improve software solutions with guidance.\nCollaborate with other cross-functional teams to deliver new features and products.\nDevelop an actionable, user-friendly experience, as measured by success metrics.\nComply with all company health and safety policies, procedures, and legal requirements.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2FckdPBOC9nGKLHwVE4uyWsef36WyX-M3WGPqxknUeAvHv5EjoASXckS82IN4M2BWH9sqBqAPtfR0fpWVhmoljSv9_Oo1jdI3Re3fFH6C_Jn4GzxoHCw0X1geUyHby6_V2&loc=GB&title=Software+Engineer+II&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759727-2",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/89929172624777926-software-engineer-ii-learning-incident-response-management-cloud?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Software Engineer II, Learning, Incident Response Management, Cloud",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n1 year of experience with data structures or algorithms.\n\nPreferred qualifications:\nExperience developing accessible technologies.",
    "about-role": "About the jobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nGoogle Cloud accelerates every organization’s ability to digitally transform its business and industry. We deliver enterprise-grade solutions that leverage Google’s cutting-edge technology, and tools that help developers build more sustainably. Customers in more than 200 countries and territories turn to Google Cloud as their trusted partner to enable growth and solve their most critical business problems.",
    "responsibiltities": "Responsibilities\nWrite product or system development code.\nParticipate in, or lead design reviews with peers and stakeholders to decide amongst available technologies.\nReview code developed by other developers and provide feedback to ensure best practices (e.g., style guidelines, checking code in, accuracy, testability, and efficiency).\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nTriage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2FckWQHpZyX8St474tLshN0yZTRugYM3gnRtwd0VhRmOd1aEjsASXckS8PJLPxSlhF6NHJEJYO36IgIN39xdkZ9pnelkoKq45giSEDqySgJqv7eRWqA20kBsybAMfe5ow%3D%3D_V2&loc=GB&title=Software+Engineer+II&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759729-3",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/141017284624687814-administrative-business-partner-youtube-business-part-time?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Administrative Business Partner, YouTube Business (Part Time)",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor's degree or equivalent practical experience.\n2 years of administrative experience in a technology or international environment working on core administrative tasks (e.g., travel management, expense reports, calendar management, facilities coordination, etc.).\n\nPreferred qualifications:\nExperience in global international travel coordination or similar.\nAbility to navigate and manage a variety of competing priorities in a timely and efficient manner.\nAbility to effectively communicate and collaborate with a diverse range of people and job functions.",
    "about-role": "About the jobAs an Administrative Business Partner, you're at the heart of your team's business operations and activities and the soul that keeps your team moving forward. You anticipate the needs of your managers and team members and help them stay focused on their projects by resolving operational and administrative issues before they arise. You move quickly with the changing environment and are up to date with the latest Google products and services. You also use that knowledge to strategically support your team's projects. In addition to being organized and analytical, you possess the strong business judgment and communication skills needed to interact with a variety of people and job functions.\nThis is a part-time role job that will work Wednesday - Friday and share with the senior Administrative Business Partner, with one overlap day in the office for handovers and effective collaboration.Administrative jobs at Google are staffed by organized and dependable people driven by a common company goal: to help us accomplish great things. Working behind the scenes, we make a significant impact on the people we support as well as on Google users around the world. We're adept at leading and managing a variety of simultaneous projects, which requires the particular talent of being able to communicate effectively with all levels of the organization.",
    "responsibiltities": "Responsibilities\nAnticipate needs, proactively solve problems, and stay ahead of the curve on YouTube's products and services to provide strategic support.\nComplete core administrative tasks (e.g., travel management, expense reporting, calendar management, facilities coordination).\nPlan and organize internal and external programs and events, and manage event logistics in collaboration with internal partners and external vendors.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2FckeNN1YzuE70d11JuttV-azCGiT8BEPq4IkasZgGNwtEyEjsASXckS00ruji3iR-yW8Mn1OMmN_TY4gJdG_rNpNMBE2uybwozI_coxBHm9fcShTTvcx5Iqcx04ZVTww%3D%3D_V2&loc=GB&title=Administrative+Business+Partner&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759732-4",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/138482191452512966-software-engineer-ii-ios-ai-fitness-coaching?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Software Engineer II, iOS, AI Fitness Coaching",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n\n1 year of experience with iOS application development.\nExperience with test automation, test coverage, Swift and Objective-C.\n\nPreferred qualifications:\nMaster's degree in Computer Science or a related technical field.\n1 year of experience with data structures or algorithms.\nExperience designing, testing, delivering, and monitoring scalable high-availability software in a cloud computing environment.\nExperience working on highly scalable, database-backed, distributed systems and communicating with internal and external partners to create system design.\nAbility to work and achieve results without daily supervision collaborating with other engineers.\nAbility to focus on delivering value rather than pure engineering.",
    "about-role": "About the jobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nThe Platforms and Devices team encompasses Google's various computing software platforms across environments (desktop, mobile, applications), as well as our first party devices and services that combine the best of Google AI, software, and hardware. Teams across this area research, design, and develop new technologies to make our user's interaction with computing faster and more seamless, building innovative experiences for our users around the world.",
    "responsibiltities": "Responsibilities\nParticipate in the full cycle of development: from an idea through design, implementation, testing to exposing features to end users.\n\nCollaborate with multiple teams inside Google (e.g., Product Management, User Experience, Identity, Product Security, Customer Support, feature development teams, Database Engineering, and Site Reliability Engineering).\n\nContribute to the multi-year effort of integrating the software stack with Google Production systems and partner subscription lifecycle management solutions.\n\nContribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\nEnsure appropriate test automation and coverage for developed features to ensure high quality at scale.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2FckUw8zZ3DngyGanhsSkAHgUh1nikquYzewQVzY60w4eVoEjsASXckSwl9KYR1eKahbcLNJxLba-o4bXYVit8sCuhlZcEJWH6cGUspO4ikoBEXBJqx0588sksMUMVuTA%3D%3D_V2&loc=GB&title=Software+Engineer+II&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759734-5",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/99575061769265862-software-engineer-ii-play-developer-content-protection?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Software Engineer II, Play Developer, Content protection",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n\n1 year of experience with data structures or algorithms.\n\n1 year of experience with full stack development, across back-end such as Java, Python, GO, or C++ codebases, and front-end experience including JavaScript or TypeScript, HTML, CSS or equivalent.\n\nPreferred qualifications:\nExperience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n\nExperience with Android application development.\n\nExperience with Java and Dart.",
    "about-role": "About the jobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nGoogle Play offers music, movies, books, apps and games for devices, powered by the cloud. It syncs across devices and on the web. As part of the Android and Mobile team, Googlers working on Google Play do everything from engineering our backend systems, to shaping product strategy, to forming great content partnerships. They make it possible for people to do things like buy an ebook or song on their Android phone, then have it instantly available on their laptop. The Google Play team enhances the Android ecosystem by giving developers and partners a premium store where they can reach millions of users.",
    "responsibiltities": "Responsibilities\nDesign, develop, test, deploy, maintain, and enhance software solutions.\nEnsure of implementing unit and integration tests as well as other software development best practices.\nTriage technical issues and debug/track/resolve by analyzing the sources of issues and conducting investigation.\nCollaborate with cross-functional teams to deliver new features and products.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2FckSs7go5N3F_WJDj7JHDaMXWydIwv_LqJymp1fbS2QbsnEjsAgOFyAxt2U96OPdbdL8_BwAx3zDZwkH2ZDY9VxJoB4dk22XQYKj8peSU6X4fDB_4UjjJpU65DgNpdFg%3D%3D_V2&loc=GB&title=Software+Engineer+II&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759737-6",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/96441751593460422-software-engineer-early-career-campus?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Software Engineer, Early Career, Campus",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor's degree in Computer Science, a related technical field, or equivalent practical experience.\nExperience coding in one of the following programming languages including but not limited to: C, C++, Java, JavaScript, or Python.\n\nPreferred qualifications:\nExperience with Unix/Linux environments, distributed systems, machine learning, information retrieval, and TCP/IP.\nExperience in network programming or developing/designing large software systems.",
    "about-role": "About the jobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nAs a key member of a small and versatile team, you design, test, deploy and maintain software solutions.\nThe Platforms and Devices team encompasses Google's various computing software platforms across environments (desktop, mobile, applications), as well as our first party devices and services that combine the best of Google AI, software, and hardware. Teams across this area research, design, and develop new technologies to make our user's interaction with computing faster and more seamless, building innovative experiences for our users around the world.",
    "responsibiltities": "Responsibilities\nResearch, conceive, and develop software applications to extend and improve on Google's product offering.\nContribute to a wide variety of projects utilizing natural language processing, artificial intelligence, data compression, machine learning, and search technologies.\nCollaborate on scalability issues involving access to massive amounts of data and information.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2FckV7UHd67QyzPwJ2VEcXyhTeBInH6tQec6lz55R42eYJYEjsAgOFyA47eML0RzM49Z42GSEa4CgG5YzJyUSdXg57i_3D4meSlqc3IDU7UnvwJRpP_Q2BjYgWvvDgubg%3D%3D_V2&loc=GB&title=Software+Engineer&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759739-7",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/109823538449261254-software-engineer-ii-android-tracking-experiences?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Software Engineer II, Android, Tracking Experiences",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n\n1 year of experience with data structures or algorithms.\n\n1 year of experience with Android application development.\n\n\nPreferred qualifications:\nExperience working with Kotlin.",
    "about-role": "About the jobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nThe Platforms and Devices team encompasses Google's various computing software platforms across environments (desktop, mobile, applications), as well as our first party devices and services that combine the best of Google AI, software, and hardware. Teams across this area research, design, and develop new technologies to make our user's interaction with computing faster and more seamless, building innovative experiences for our users around the world.",
    "responsibiltities": "Responsibilities\nDevelop high-volume, production applications with quality, including implementing unit and integration tests as well as embody software architecture best practices.\nDesign, develop, test, deploy, maintain, document and improve software solutions with guidance.\nCollaborate with other cross-functional teams to deliver new features and products.\nDevelop an actionable, user-friendly experience, as measured by success metrics.\nComply with all company health and safety policies, procedures, and legal requirements.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2FckQjTc0EQu8w2ChG_0V_QeXq95z5_iJvqLXpHNW5bbwDrEjsASXckSx4JuXSxEBbOypVSgVDOI9DuykjHl4BNEXWcT0QgI_if3mJ2h1JpNvX3G2M8OW1oSBIJ4Mgpqg%3D%3D_V2&loc=GB&title=Software+Engineer+II&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759741-8",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/96146790620766918-youtube-partner-operations-manager-creator-success-operations-multiple-languages?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "YouTube Partner Operations Manager, Creator Success Operations (Multiple Languages)",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor's degree in a technical, business, or a related field or equivalent practical experience.\n2 years of experience in managing projects or programs, engaging with external executive stakeholders.\n2 years of experience in customer support or client services, including troubleshooting and resolving customer issues.\nAbility to communicate in English, and German and French or Russian fluently as this is a customer-facing role that requires interactions with local stakeholders.\n\nPreferred qualifications:\nProficiency in SQL.\nAbility to manage multiple, time-sensitive projects while working independently to drive projects to completion with guidance and high attention to detail.\nAbility to navigate and manage competing priorities in a fluid environment.\nAbility to make constructive suggestions and develop innovative ways to scale initiatives.\nAbility to troubleshoot technical issues.",
    "about-role": "About the jobAs a member of the Partner Operations team, you'll analyze top issues facing our content creators, work with cross-functional teams to resolve them, and help manage support operations. Whether directly engaging with our biggest creators, surfacing problems to our technical teams, driving analytical insights, or liaising with vendors to provide stellar support, you'll drive reach, satisfaction, and resolution — making YouTube an exceptional user experience for everyone.\nAt YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.",
    "responsibiltities": "Responsibilities\nProvide operational support for partners on the YouTube platform, primarily through email communication.\nTroubleshoot technical issues to enable Partners to maximize their performance on the platform.\nServe as a consultant to internal, cross-functional stakeholders on the YouTube product. Work with assigned Partner Managers and Partner Engineers on account in-depth search and share insights for partner growth.\nIdentify opportunities for operational workflow optimization and process improvement. Utilize key metrics to assess data through both quantitative and qualitative analysis, generating actionable insights.\nContribute to scaling Partner Operations for YouTube through innovation, efficiency gains, and root cause analysis. Streamline the operational workflow by identifying and eliminating bottlenecks.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2Fcka1WSr4AKgnHQ_tWHmgksGrTcmBYKaMtaGwEUv1Ko5sCEjsASXckS4Wa_L9DQmxSSQDhnROTV0lmiGslTxMM2krwR40Ap1uPo-UkWGop1OQJ0y_68kvqZRygMv0tsQ%3D%3D_V2&loc=GB&title=YouTube+Partner+Operations+Manager&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759743-9",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/104325431091438278-software-engineer-ii-play-console?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Software Engineer II, Play Console",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n\n\nPreferred qualifications:\n1 year of experience with data structures or algorithms.\nExperience with full stack coding.\nExperience developing large-scale distributed systems.\nStrong communication, collaboration, and initiative skills.",
    "about-role": "About the jobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nGoogle Play offers music, movies, books, apps and games for devices, powered by the cloud. It syncs across devices and on the web. As part of the Android and Mobile team, Googlers working on Google Play do everything from engineering our backend systems, to shaping product strategy, to forming great content partnerships. They make it possible for people to do things like buy an ebook or song on their Android phone, then have it instantly available on their laptop. The Google Play team enhances the Android ecosystem by giving developers and partners a premium store where they can reach millions of users.",
    "responsibiltities": "Responsibilities\nWrite high quality and well engineered code (Java, Dart, Boq, Spanner, Flume).\nScope, design, and deliver full-stack software solutions end-to-end.\nCollaborate with peers and stakeholders.\nImprove existing and upcoming features, focusing on helping developers.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2FckS0uzsz4aGXeA1xXPwG_P1A-xRuzUkwtxz-ZEFBANnebEjsASXckSxb64CoZC7bLBj-2B4LOwHKT-XSiBnurL1B9WT1z-rLohiq7O_Yn5ryA0yC4atCGsbjFc2QgkQ%3D%3D_V2&loc=GB&title=Software+Engineer+II&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759746-10",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/118482269827408582-data-center-facilities-technician-electrical?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Data Center Facilities Technician, Electrical",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nAssociate's degree, trade school certification, or other certified training in a related technical field, or equivalent practical experience.\n2 years of electrical experience (e.g., electrical testing equipment or electrical distribution) in an industrial or commercial environment.\nAbility to lift and move 50 lbs of equipment under raised floors, and the required use of OSHA standard safety equipment such as limited weight bearing work platforms, ladders, step stools and Personal Protective Equipment (PPE) like safety harnesses.\nAbility to work non-standard hours and work rotations/shifts.\n\nPreferred qualifications:\nExperience in data centers, hospitals, or power plants.\nKnowledge of electrical systems used in a data center environment (e.g., Feeders, Transformers, Generators, Switchgear, UPS systems, ATS/STS units, PDU/PMM units).\nKnowledge of meters, devices, sensors, and troubleshooting utilizing standard hand tools, digital metering, or calibration/diagnostic equipment.\nAbility to communicate with contractors who perform maintenance or upgrade work on the data center systems.",
    "about-role": "About the jobThe Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.\n\nAs an advocate for best practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly. In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures. \n\nAs a Data Center Facilities Technician, you will operate, monitor, and support physical facilities conditions for our data centers.The Data Center team designs and operates some of the most sophisticated electrical and HVAC systems in the world. We are a diverse, upbeat, creative, team-oriented group of engineers committed to building and operating powerful data centers.",
    "responsibiltities": "Responsibilities\nInspect, maintain, and repair various data center systems.\nProvide daily assistance to technicians as you read blueprints/schematics/sequence of operations, conduct tours of systems, and assess their working order.\nManage the uptime and maintenance of UPS, generators, electrical distribution, and control and monitoring systems.\nOperate, monitor, maintain, and respond to abnormal conditions in the data center facilities systems and equipment.\nSupport startup, commissioning, and integration of new electrical equipment and systems into facilities infrastructure.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2FckUpMFzNW65XgUZx_k_5e6j4q8M3CVinWj3a_VAr3KlrLEjsASXckS6xhrAVnEIG5OL85xWzTnB-bVWV3w17N46O4nJLKuar-Er88uc3qhS5nr1FhBuxpRQj5l-Uj6Q%3D%3D_V2&loc=GB&title=Data+Center+Facilities+Technician&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759748-11",
    "web-scraper-start-url": "https://www.google.com/about/careers/applications/jobs/results/?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "programme-page": "",
    "programme-page-href": "https://www.google.com/about/careers/applications/jobs/results/122683632606159558-software-engineer-ii-android-health-and-fitness-tracking?target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United%20Kingdom",
    "role-name": "Software Engineer II, Android, Health and Fitness Tracking",
    "role-location": "London, UK",
    "minimum-qualifications": "Minimum qualifications:\nBachelor’s degree or equivalent practical experience.\n\n1 year of experience with software development in one or more programming languages (e.g., Python, C, C++, Java, JavaScript).\n\n1 year of experience with data structures or algorithms.\n\n1 year of experience with Android application development.\n\n\nPreferred qualifications:\nExperience working with Kotlin.",
    "about-role": "About the jobGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\nThe Platforms and Devices team encompasses Google's various computing software platforms across environments (desktop, mobile, applications), as well as our first party devices and services that combine the best of Google AI, software, and hardware. Teams across this area research, design, and develop new technologies to make our user's interaction with computing faster and more seamless, building innovative experiences for our users around the world.",
    "responsibiltities": "Responsibilities\nDevelop robust, high-volume, production applications with quality, including implementing unit and integration tests as well as embody software architecture best practices.\nDesign, develop, test, deploy, maintain, document and improve software solutions with guidance.\nCollaborate with other cross-functional teams to deliver new features and products.\nDevelop an actionable, user-friendly experience, as measured by success metrics.\nComply with all company health and safety policies, procedures, and legal requirements.",
    "apply-button": "",
    "apply-button-href": "https://www.google.com/about/careers/applications/apply?jobId=CiUAL2Fckaf0vwwFjC4KykxnlcjbW3VS6jSR4qp1Br0o1abJK-leEjsASXckS55WQ1RlV8ToluyTJvHMOLX4Kevy5LDcaX_0AJ__6xY0EItOarKyNt_ELfquwrfiFRMLTfdVQg%3D%3D_V2&loc=GB&title=Software+Engineer+II&target_level=INTERN_AND_APPRENTICE&target_level=EARLY&location=United+Kingdom",
    "source": "google-grads"
  },
  {
    "web-scraper-order": "1752759662-1",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Internal Audit | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150706",
    "role-name": "2026 | EMEA | London | Internal Audit | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nInternal Audit (IA) Assesses the firm’s internal control structure, advises management on developing control solutions and monitors the implementation of these measures. \nIn Internal Audit, we ensure that Goldman Sachs maintains effective controls by assessing the reliability of financial reports, monitoring the firm’s compliance with laws and regulations, and advising management on developing smart control solutions. Our group has unique insight on the financial industry and its products and operations.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150706/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759664-2",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "Coming August 20252026 | EMEA | London | Asset Management, Quantitative Investing | Summer AnalystLondon·United Kingdom·Summer Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150851",
    "role-name": "2026 | EMEA | London | Asset Management, Quantitative Investing | Summer Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur Summer Analyst Program is a nine to ten week summer internship for students pursuing a bachelors / graduate degree. You will be fully immersed in our day-to-day activities.\nAs a participant, you will:\nAttend orientation where you’ll learn about our culture, as well as the benefits and responsibilities of being a member of the firmReceive training designed to help you succeedHave the opportunity to work on real responsibilities alongside fellow interns and our people\n\n Submitting Your Application\n\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nAsset Management provides investment management solutions across all major asset classes to a diverse set of institutional and individual clients.\nBringing together traditional and alternative investments, we provide clients around the world with a dedicated partnership and focus on long-term performance. As the firm’s primary investment area, we provide investment and advisory services for some of the world’s leading pension plans, sovereign wealth funds, insurance companies, endowments, foundations, financial advisors and individuals, for which we oversee more than $2 trillion in assets under supervision. Working in a culture that values integrity and transparency, you will be part of a diverse team that is passionate about our craft, our clients, and building sustainable success. We are:\n·         Investors, spanning traditional and alternative markets offering products and services\n·         Advisors, understanding our clients’ priorities and poised to help provide investment advice and strategies that make sense for their portfolios\n·         Thought Leaders, providing timely insights across macro and secular themes to help inform our clients’ investment decisions\n·         Innovators, using our suite of digital solutions to help our clients address complex challenges and meet their financial goals",
    "apply-button": "Coming Soon",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150851/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759667-3",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Asset Management, Public Investing | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150733",
    "role-name": "2026 | EMEA | London | Asset Management, Public Investing | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nAsset Management provides investment management solutions across all major asset classes to a diverse set of institutional and individual clients.\nBringing together traditional and alternative investments, we provide clients around the world with a dedicated partnership and focus on long-term performance. As the firm’s primary investment area, we provide investment and advisory services for some of the world’s leading pension plans, sovereign wealth funds, insurance companies, endowments, foundations, financial advisors and individuals, for which we oversee more than $2 trillion in assets under supervision. Working in a culture that values integrity and transparency, you will be part of a diverse team that is passionate about our craft, our clients, and building sustainable success. We are:\n·         Investors, spanning traditional and alternative markets offering products and services\n·         Advisors, understanding our clients’ priorities and poised to help provide investment advice and strategies that make sense for their portfolios\n·         Thought Leaders, providing timely insights across macro and secular themes to help inform our clients’ investment decisions\n·         Innovators, using our suite of digital solutions to help our clients address complex challenges and meet their financial goals",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150733/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759669-4",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "Coming August 20252026 | EMEA | London | Asset Management, Client Solutions Group / Sales | Summer AnalystLondon·United Kingdom·Summer Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150849",
    "role-name": "2026 | EMEA | London | Asset Management, Client Solutions Group / Sales | Summer Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur Summer Analyst Program is a nine to ten week summer internship for students pursuing a bachelors / graduate degree. You will be fully immersed in our day-to-day activities.\nAs a participant, you will:\nAttend orientation where you’ll learn about our culture, as well as the benefits and responsibilities of being a member of the firmReceive training designed to help you succeedHave the opportunity to work on real responsibilities alongside fellow interns and our people\n\n Submitting Your Application\n\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nAsset Management provides investment management solutions across all major asset classes to a diverse set of institutional and individual clients.\nBringing together traditional and alternative investments, we provide clients around the world with a dedicated partnership and focus on long-term performance. As the firm’s primary investment area, we provide investment and advisory services for some of the world’s leading pension plans, sovereign wealth funds, insurance companies, endowments, foundations, financial advisors and individuals, for which we oversee more than $2 trillion in assets under supervision. Working in a culture that values integrity and transparency, you will be part of a diverse team that is passionate about our craft, our clients, and building sustainable success. We are:\n·         Investors, spanning traditional and alternative markets offering products and services\n·         Advisors, understanding our clients’ priorities and poised to help provide investment advice and strategies that make sense for their portfolios\n·         Thought Leaders, providing timely insights across macro and secular themes to help inform our clients’ investment decisions\n·         Innovators, using our suite of digital solutions to help our clients address complex challenges and meet their financial goals",
    "apply-button": "Coming Soon",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150849/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759671-5",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Wealth Management, Product Management | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150637",
    "role-name": "2026 | EMEA | London | Wealth Management, Product Management | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nWealth Management includes Private Wealth Management, Goldman Sachs Ayco and Private Banking, Lending & Deposits. \nAcross Wealth Management, Goldman Sachs helps empower clients and customers around the world to reach their financial goals. Our advisor-led wealth management businesses provide financial planning, investment management, banking and comprehensive advice to a wide range of clients, including ultra-high net worth and high net worth individuals, as well as family offices, foundations and endowments, and corporations and their employees. Across Wealth Management, our growth is driven by a relentless focus on our people, our clients and customers, and leading-edge technology, data and design.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150637/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759674-6",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Asset Management, Quantitative Investing | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150726",
    "role-name": "2026 | EMEA | London | Asset Management, Quantitative Investing | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nAsset Management provides investment management solutions across all major asset classes to a diverse set of institutional and individual clients.\nBringing together traditional and alternative investments, we provide clients around the world with a dedicated partnership and focus on long-term performance. As the firm’s primary investment area, we provide investment and advisory services for some of the world’s leading pension plans, sovereign wealth funds, insurance companies, endowments, foundations, financial advisors and individuals, for which we oversee more than $2 trillion in assets under supervision. Working in a culture that values integrity and transparency, you will be part of a diverse team that is passionate about our craft, our clients, and building sustainable success. We are:\n·         Investors, spanning traditional and alternative markets offering products and services\n·         Advisors, understanding our clients’ priorities and poised to help provide investment advice and strategies that make sense for their portfolios\n·         Thought Leaders, providing timely insights across macro and secular themes to help inform our clients’ investment decisions\n·         Innovators, using our suite of digital solutions to help our clients address complex challenges and meet their financial goals",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150726/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759676-7",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Compliance | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150664",
    "role-name": "2026 | EMEA | London | Compliance | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\n\nGlobal Compliance manages the firm’s compliance, regulatory and reputational risks by ensuring adherence to laws, rules and regulations. The division monitors trends and changes in regulations in all jurisdictions in which the firm does business and develops and implements firmwide and divisional policies and procedures. In addition to advising and partnering with the firm’s businesses, Global Compliance is responsible for managing audits and inquiries, educating, surveillance and testing the firm’s risk management infrastructure.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150664/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759679-8",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Investment Banking, Classic | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150650",
    "role-name": "2026 | EMEA | London | Investment Banking, Classic | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nOur Investment Banking teams deliver high-quality strategic advice and creative financing solutions to our clients, including mergers and acquisitions, financing, and risk management transactions.\nWe pride ourselves in our resourcefulness and work on a variety of initiatives. On any given day, our work could include advising a company on a cross-border merger, structuring the initial public offering of a subsidiary, refinancing an outstanding bond and more.\nAs a division, our strategic objectives include:\n·         To be the world’s preeminent investment bank – trusted advisor, financier and risk manager for our clients on their most important transactions\n·         Build long-term relationships with clients and bring them world-class execution by “delivering the firm” over time\n·         Drive superior returns for our stakeholders\n·         Be the employer of choice for all career levels by providing a highly dynamic, meritocratic, diverse and rewarding workplace",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150650/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759681-9",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Asset Management, Client Solutions Group / Sales | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150720",
    "role-name": "2026 | EMEA | London | Asset Management, Client Solutions Group / Sales | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nAsset Management provides investment management solutions across all major asset classes to a diverse set of institutional and individual clients.\nBringing together traditional and alternative investments, we provide clients around the world with a dedicated partnership and focus on long-term performance. As the firm’s primary investment area, we provide investment and advisory services for some of the world’s leading pension plans, sovereign wealth funds, insurance companies, endowments, foundations, financial advisors and individuals, for which we oversee more than $2 trillion in assets under supervision. Working in a culture that values integrity and transparency, you will be part of a diverse team that is passionate about our craft, our clients, and building sustainable success. We are:\n·         Investors, spanning traditional and alternative markets offering products and services\n·         Advisors, understanding our clients’ priorities and poised to help provide investment advice and strategies that make sense for their portfolios\n·         Thought Leaders, providing timely insights across macro and secular themes to help inform our clients’ investment decisions\n·         Innovators, using our suite of digital solutions to help our clients address complex challenges and meet their financial goals",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150720/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759683-10",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Risk | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150672",
    "role-name": "2026 | EMEA | London | Risk | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nRisk aims to effectively identify, monitor, evaluate and manage the firm’s financial and non-financial risks in support of the firm’s strategic plan.\nOur Risk division develops comprehensive processes to monitor, assess and manage the risk of expected and unexpected events that may have an adverse impact on the firm. Risk teams play a critical function for the firm, driving how the firm takes and manages risk. Risk professionals execute critical day-to-day risk management activities, lead projects and contribute to the ongoing advancement of a robust risk management program. Effective coordination with executive management, business units, control departments and technology is critical for success.\nWe are at the forefront of the most recent engineering solutions, including cloud computing and big data, to better manage compute costs for the firm given increasing demands related to asset pricing and scenario generation.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150672/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759686-11",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "Coming August 20252026 | EMEA | London | Asset Management, Real Estate | Summer AnalystLondon·United Kingdom·Summer Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150857",
    "role-name": "2026 | EMEA | London | Asset Management, Real Estate | Summer Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur Summer Analyst Program is a nine to ten week summer internship for students pursuing a bachelors / graduate degree. You will be fully immersed in our day-to-day activities.\nAs a participant, you will:\nAttend orientation where you’ll learn about our culture, as well as the benefits and responsibilities of being a member of the firmReceive training designed to help you succeedHave the opportunity to work on real responsibilities alongside fellow interns and our people\n\n Submitting Your Application\n\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nAsset Management provides investment management solutions across all major asset classes to a diverse set of institutional and individual clients.\nBringing together traditional and alternative investments, we provide clients around the world with a dedicated partnership and focus on long-term performance. As the firm’s primary investment area, we provide investment and advisory services for some of the world’s leading pension plans, sovereign wealth funds, insurance companies, endowments, foundations, financial advisors and individuals, for which we oversee more than $2 trillion in assets under supervision. Working in a culture that values integrity and transparency, you will be part of a diverse team that is passionate about our craft, our clients, and building sustainable success. We are:\n·         Investors, spanning traditional and alternative markets offering products and services\n·         Advisors, understanding our clients’ priorities and poised to help provide investment advice and strategies that make sense for their portfolios\n·         Thought Leaders, providing timely insights across macro and secular themes to help inform our clients’ investment decisions\n·         Innovators, using our suite of digital solutions to help our clients address complex challenges and meet their financial goals",
    "apply-button": "Coming Soon",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150857/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759688-12",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Controllers | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150668",
    "role-name": "2026 | EMEA | London | Controllers | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nControllers manages the firm’s financial and regulatory obligations in accordance with rules and regulations governing worldwide financial markets.\nWe are a global team responsible for ensuring the accuracy of the firm’s financial and regulatory information by complying with the rules and regulations governing financial markets worldwide. As well as managing both internal and external financial reporting, our expertise plays a key role in the firm’s business planning decisions around allocation of scarce financial resources such as capital and balance sheet. We partner with the business in providing advice on accounting, valuation, capital, liquidity, reputational risk and other regulatory considerations when executing business with our clients. Controllers is ideal for individuals who want to work and learn within our strong culture of teamwork and collaboration.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150668/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759690-13",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "Coming August 20252026 | EMEA | London | Asset Management, Public Investing | Summer AnalystLondon·United Kingdom·Summer Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150854",
    "role-name": "2026 | EMEA | London | Asset Management, Public Investing | Summer Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur Summer Analyst Program is a nine to ten week summer internship for students pursuing a bachelors / graduate degree. You will be fully immersed in our day-to-day activities.\nAs a participant, you will:\nAttend orientation where you’ll learn about our culture, as well as the benefits and responsibilities of being a member of the firmReceive training designed to help you succeedHave the opportunity to work on real responsibilities alongside fellow interns and our people\n\n Submitting Your Application\n\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nAsset Management provides investment management solutions across all major asset classes to a diverse set of institutional and individual clients.\nBringing together traditional and alternative investments, we provide clients around the world with a dedicated partnership and focus on long-term performance. As the firm’s primary investment area, we provide investment and advisory services for some of the world’s leading pension plans, sovereign wealth funds, insurance companies, endowments, foundations, financial advisors and individuals, for which we oversee more than $2 trillion in assets under supervision. Working in a culture that values integrity and transparency, you will be part of a diverse team that is passionate about our craft, our clients, and building sustainable success. We are:\n·         Investors, spanning traditional and alternative markets offering products and services\n·         Advisors, understanding our clients’ priorities and poised to help provide investment advice and strategies that make sense for their portfolios\n·         Thought Leaders, providing timely insights across macro and secular themes to help inform our clients’ investment decisions\n·         Innovators, using our suite of digital solutions to help our clients address complex challenges and meet their financial goals",
    "apply-button": "Coming Soon",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150854/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759693-14",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Global Investment Research, Equity Research | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150645",
    "role-name": "2026 | EMEA | London | Global Investment Research, Equity Research | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nGlobal Investment Research delivers client-focused research in the equity, fixed income, currency and commodities markets.\nWe are a global team that provides fundamental research on companies and economies, as well as industries, currencies and commodities. Our research analysts are surrounded by dedicated software engineers, data scientists, content designers, and supervisory and operational services teams.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150645/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759695-15",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Operations | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/151158",
    "role-name": "2026 | EMEA | London | Operations | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nOperations is at the core of Goldman Sachs. For every trade agreed, every new product launched or market entered, every transaction completed, it is Operations that enables business to flow.\nOperations is integrated within our businesses and delivers banking, sales and trading, and asset management capabilities to all our clients. We work to protect the accuracy and efficiency at every step of the trade. For example, if a company wants to buy a block of stock, Operations first ensures that the stock and payment are ready to be traded. Next, we make sure that the trade is settled properly and on time. And finally, Operations confirms that each trade is reported accurately to the buyer, the seller, the firm and the regulators. Along the way, Operations looks for anything that could expose our clients or the firm to financial loss, penalty or other risks. Operations does this for every transaction all around the world. Operations also aids in the design of the technology, the information flows and the processes that make it all work. We constantly monitor these systems and reengineer them to keep everything running as efficiently as possible.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/151158/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759698-16",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | FICC & Equities (Sales & Trading) | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150701",
    "role-name": "2026 | EMEA | London | FICC & Equities (Sales & Trading) | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nGlobal Banking & Markets (Public) / FICC and Equities (Sales and Trading) enables our clients to buy and sell financial products, raise funding and manage risk. We make markets and facilitate client transactions in fixed income, equity, currency and commodity products.\nWe make markets in and clear client transactions on major stock, options and futures exchanges worldwide. Through our global sales force, we maintain relationships with our clients, receiving orders and distributing investment research, trading ideas, market information and analysis.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150701/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759700-17",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Wealth Management, Wealth Management Professional | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150618",
    "role-name": "2026 | EMEA | London | Wealth Management, Wealth Management Professional | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nWealth Management includes Private Wealth Management, Goldman Sachs Ayco and Private Banking, Lending & Deposits. \nAcross Wealth Management, Goldman Sachs helps empower clients and customers around the world to reach their financial goals. Our advisor-led wealth management businesses provide financial planning, investment management, banking and comprehensive advice to a wide range of clients, including ultra-high net worth and high net worth individuals, as well as family offices, foundations and endowments, and corporations and their employees. Across Wealth Management, our growth is driven by a relentless focus on our people, our clients and customers, and leading-edge technology, data and design.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150618/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759702-18",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Wealth Management, Quantitative Finance | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150633",
    "role-name": "2026 | EMEA | London | Wealth Management, Quantitative Finance | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nWealth Management includes Private Wealth Management, Goldman Sachs Ayco and Private Banking, Lending & Deposits. \nAcross Wealth Management, Goldman Sachs helps empower clients and customers around the world to reach their financial goals. Our advisor-led wealth management businesses provide financial planning, investment management, banking and comprehensive advice to a wide range of clients, including ultra-high net worth and high net worth individuals, as well as family offices, foundations and endowments, and corporations and their employees. Across Wealth Management, our growth is driven by a relentless focus on our people, our clients and customers, and leading-edge technology, data and design.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150633/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759704-19",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Investment Banking, Capital Solutions Group | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150654",
    "role-name": "2026 | EMEA | London | Investment Banking, Capital Solutions Group | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nOur Investment Banking teams deliver high-quality strategic advice and creative financing solutions to our clients, including mergers and acquisitions, financing, and risk management transactions.\nWe pride ourselves in our resourcefulness and work on a variety of initiatives. On any given day, our work could include advising a company on a cross-border merger, structuring the initial public offering of a subsidiary, refinancing an outstanding bond and more.\nAs a division, our strategic objectives include:\n·         To be the world’s preeminent investment bank – trusted advisor, financier and risk manager for our clients on their most important transactions\n·         Build long-term relationships with clients and bring them world-class execution by “delivering the firm” over time\n·         Drive superior returns for our stakeholders\n·         Be the employer of choice for all career levels by providing a highly dynamic, meritocratic, diverse and rewarding workplace",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150654/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759707-20",
    "web-scraper-start-url": "https://higher.gs.com/campus?LOCATION=London&page=1&sort=RELEVANCE",
    "programme-list": "2026 | EMEA | London | Wealth Management, Financial Analyst | New AnalystLondon·United Kingdom·Analyst",
    "programme-list-href": "https://higher.gs.com/roles/150613",
    "role-name": "2026 | EMEA | London | Wealth Management, Financial Analyst | New Analyst",
    "office-location": "London",
    "role-description": "About the program\nOur New Analyst Program is a full-time program for final year undergraduate and graduate students. As a new analyst, you will learn about our businesses, develop important relationships, and build career-enhancing skills.\nAs a participant, you will:\nLearn about the firm and how we do businessGain the skills and knowledge necessary to support our businessesHave unlimited access to the training and guidance to help you prepare for the next levelBuild your professional network and interact with colleagues across the firmSubmitting Your Application\n\n \n  Each applicant has the opportunity to apply to up to 4 separate business / location combinations in any given recruiting year. Any additional application will be auto withdrawn. In order to apply to an additional opportunity, you must withdraw a current application that has not been turned down.A single applicant should not create multiple email addresses to apply to additional opportunities \n \n\nAbout the division\nWealth Management includes Private Wealth Management, Goldman Sachs Ayco and Private Banking, Lending & Deposits. \nAcross Wealth Management, Goldman Sachs helps empower clients and customers around the world to reach their financial goals. Our advisor-led wealth management businesses provide financial planning, investment management, banking and comprehensive advice to a wide range of clients, including ultra-high net worth and high net worth individuals, as well as family offices, foundations and endowments, and corporations and their employees. Across Wealth Management, our growth is driven by a relentless focus on our people, our clients and customers, and leading-edge technology, data and design.",
    "apply-button": "Apply",
    "apply-button-href": "https://hdpc.fa.us2.oraclecloud.com/hcmUI/CandidateExperience/en/sites/CampusHiring/jobs/preview/150613/apply/email?mode=location",
    "source": "goldman-sachs-grads"
  },
  {
    "web-scraper-order": "1752759300-1",
    "web-scraper-start-url": "https://www.capgemini.com/gb-en/careers/join-us/?page=1&size=11&experience_level=Students%2FGraduates%E2%80%8B&country_code=gb-en",
    "programme-link": "Defence Systems ConsultantStevenage, BristolProducts & Systems EngineeringPermanentExperienced Professionals",
    "programme-link-href": "https://www.capgemini.com/gb-en/jobs/141010-en_GB+sap_btp",
    "role-name": "",
    "role-location": "",
    "role-description": "",
    "source": "capgemini-grads"
  },
  {
    "web-scraper-order": "1752759309-2",
    "web-scraper-start-url": "https://www.capgemini.com/gb-en/careers/join-us/?page=1&size=11&experience_level=Students%2FGraduates%E2%80%8B&country_code=gb-en",
    "programme-link": "Mechanical Design EngineerBristolProducts & Systems EngineeringPermanentExperienced Professionals",
    "programme-link-href": "https://www.capgemini.com/gb-en/jobs/168919-en_GB+sap_btp",
    "role-name": "",
    "role-location": "",
    "role-description": "",
    "source": "capgemini-grads"
  },
  {
    "web-scraper-order": "1752759314-3",
    "web-scraper-start-url": "https://www.capgemini.com/gb-en/careers/join-us/?page=1&size=11&experience_level=Students%2FGraduates%E2%80%8B&country_code=gb-en",
    "programme-link": "IT/OT senior architect - DefenseManchesterManufacturing & Operations EngineeringPermanentExperienced Professionals",
    "programme-link-href": "https://www.capgemini.com/gb-en/jobs/205704-en_GB+sap_btp",
    "role-name": "",
    "role-location": "",
    "role-description": "",
    "source": "capgemini-grads"
  },
  {
    "web-scraper-order": "1752759320-4",
    "web-scraper-start-url": "https://www.capgemini.com/gb-en/careers/join-us/?page=1&size=11&experience_level=Students%2FGraduates%E2%80%8B&country_code=gb-en",
    "programme-link": "Senior OT Solutions ArchitectUndefined UK, BirminghamManufacturing & Operations EngineeringPermanentExperienced Professionals",
    "programme-link-href": "https://www.capgemini.com/gb-en/jobs/272811-en_GB+sap_btp",
    "role-name": "",
    "role-location": "",
    "role-description": "",
    "source": "capgemini-grads"
  },
  {
    "web-scraper-order": "1752759327-5",
    "web-scraper-start-url": "https://www.capgemini.com/gb-en/careers/join-us/?page=1&size=11&experience_level=Students%2FGraduates%E2%80%8B&country_code=gb-en",
    "programme-link": "Java Full Stack Engineer - Consultant - Digital ExcellenceNewcastle, Glasgow, Manchester, LondonStrategy & TransformationPermanentExperienced Professionals",
    "programme-link-href": "https://www.capgemini.com/gb-en/jobs/198216-en_GB+sap_btp",
    "role-name": "",
    "role-location": "",
    "role-description": "",
    "source": "capgemini-grads"
  },
  {
    "web-scraper-order": "1752759335-6",
    "web-scraper-start-url": "https://www.capgemini.com/gb-en/careers/join-us/?page=1&size=11&experience_level=Students%2FGraduates%E2%80%8B&country_code=gb-en",
    "programme-link": "Junior Systems EngineerBristol, BathProducts & Systems EngineeringPermanentStudents/Graduates​",
    "programme-link-href": "https://www.capgemini.com/gb-en/jobs/213825-en_GB+sap_btp",
    "role-name": "",
    "role-location": "",
    "role-description": "",
    "source": "capgemini-grads"
  },
  {
    "web-scraper-order": "1752759344-7",
    "web-scraper-start-url": "https://www.capgemini.com/gb-en/careers/join-us/?page=1&size=11&experience_level=Students%2FGraduates%E2%80%8B&country_code=gb-en",
    "programme-link": "Oracle Integration ArchitectBristol, Birmingham, LondonSaaS SolutionsPermanentExperienced Professionals",
    "programme-link-href": "https://www.capgemini.com/gb-en/jobs/215118-en_GB+sap_btp",
    "role-name": "",
    "role-location": "",
    "role-description": "",
    "source": "capgemini-grads"
  },
  {
    "web-scraper-order": "1752759352-8",
    "web-scraper-start-url": "https://www.capgemini.com/gb-en/careers/join-us/?page=1&size=11&experience_level=Students%2FGraduates%E2%80%8B&country_code=gb-en",
    "programme-link": "Flight AnalystAbingdonProducts & Systems EngineeringPermanentStudents/Graduates​",
    "programme-link-href": "https://www.capgemini.com/gb-en/jobs/241404-en_GB+sap_btp",
    "role-name": "",
    "role-location": "",
    "role-description": "",
    "source": "capgemini-grads"
  },
  {
    "web-scraper-order": "1752759359-9",
    "web-scraper-start-url": "https://www.capgemini.com/gb-en/careers/join-us/?page=1&size=11&experience_level=Students%2FGraduates%E2%80%8B&country_code=gb-en",
    "programme-link": "Junior Software EngineerBathSoftware EngineeringPermanentStudents/Graduates​",
    "programme-link-href": "https://www.capgemini.com/gb-en/jobs/240647-en_GB+sap_btp",
    "role-name": "",
    "role-location": "",
    "role-description": "",
    "source": "capgemini-grads"
  },
  {
    "web-scraper-order": "1752759223-1",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 Analytics & Sales - German Speakers",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/2025-Analytics-Sales-German-Speakers-Updated/6308",
    "role-name": "2025 Analytics & Sales - German Speakers",
    "role-location": "London",
    "role-description": "2025 Analytics & Sales - German Speakers\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            London\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Sales and Client Service\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10038161\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Analytics and Sales program is a unique opportunity to develop a comprehensive understanding of our Bloomberg products and clients in the wider context of financial markets. Following our comprehensive training program, you will apply your knowledge by assisting our clients in the Analytics department.\nIn our Analytics business, you will provide 24/7 support for Bloomberg Professional Service users all over the world and across multiple industries. Reaching us via our Helpdesk using the 'Instant Bloomberg' chat system, clients access unparalleled customer service where we answer their questions and help them maximize the value of Bloomberg's products. On any given day we respond to over 12,000 queries in more than 15 languages. From- educating a portfolio manager on Bloomberg’s risk management solutions to helping a trader use our functionality to discover new sources of market liquidity – the variety of problems we solve is immense.\nBloomberg is constantly innovating, and Analytics plays a key role in ensuring clients are educated on new products and enhancements by proactively working closely to upskill them through technology and delivering on-site training and seminars. We also work in conjunction with Sales to deliver strategic initiatives, supporting product roll-out and onboarding clients. We want to ensure our clients are making the most of our service and using tools and features that allow them to work smarter.\nAs you deepen your knowledge, you will have the opportunity to enter our sales department. In Sales, we are the face of Bloomberg for our clients. Consultative and entrepreneurial, we manage client relationships, whilst striving to continually grow our revenue by identifying new business opportunities. We spend our time with our clients, understanding their business goals and outpacing their expectations. Guided by curiosity and purpose, we work to understand their workflows and present them with the most appropriate solutions across our range of enterprise offerings.\nWhat’s in it for you?\nYou will start by completing our comprehensive Analytics & Sales training program, covering all aspects of the financial markets: industry principles, market players and asset classes - while teaching you all there is to know about the functionality and analytical tools Bloomberg has to offer!\nYou will join one of our Analytics teams, delivering exceptional customer support to our clients by providing fast and accurate solutions to their queries, while continuing to develop your knowledge through asset class and workflow specialist training.\nThere are multiple opportunities to further your career across the department or the company, with most Analytics representatives progressing towards opportunities in Sales. You may also develop into a specialized support role in our Advanced Team and in time take on a leadership role.\nWho you are?\nYou understand the drivers behind market moving stories and events. You are a solution-finder, with a real passion for providing exceptional customer service in a fast-paced environment and a desire to build a career in a client-facing role, you understand the importance of credibility and building relationships! \n\n You’ll need to have:\nFluency in German, in addition to English (written and verbal)A Bachelor’s degree (or above) or relevant work experience  Ability to multitask and resolve client inquiries while also proactively identifying sustainable workflow solutions for our clients Demonstrated interest in the financial markets and the aspiration to work in the financial services industry Strong critical-thinking and problem-solving skills The desire to learn and adapt quickly in a dynamic training and client facing environment  The ability to demonstrate resilience and agility in a fast-paced environment  A commitment to achieve the highest levels of efficiency and effectiveness  Ambition to pursue a client-facing career, with a strong interest in relationship management and sales  Outstanding communication skills (both written and verbal)  Willing and able to travel around EMEA to meet the business needs of our clients Flexibility to occasionally work weekends or on a bank holiday (weekday off in lieu) \n We’d love to see:\nDemonstrated exposure to Python or other coding languages preferable Previous experience engaging with clients in a relationship management capacity Beginner to intermediate experience with excel and/or VBA \nIf this sounds like you: \n\n Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at: [1] https://www.bloomberg.com/company/. \n\n\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=6308&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759227-2",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 Bloomberg Customer Support Representative (Japanese Speaker) - Tokyo",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/2025-Bloomberg-Customer-Support-Representative-Japanese-Speaker-Tokyo/7495",
    "role-name": "2025 Bloomberg Customer Support Representative (Japanese Speaker) - Tokyo",
    "role-location": "Tokyo",
    "role-description": "2025 Bloomberg Customer Support Representative (Japanese Speaker) - Tokyo\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            Tokyo\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Technology Support\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10039339\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Company:Bloomberg ignites the power of information and technology to bring clarity to a sophisticated world. A global financial information and news leader that provides influential decision makers a critical edge by connecting them to a dynamic network of information, people and ideas. The company delivers data, news and analytics through innovative technology and provides real time financial information to more than 325,000 subscribers globally.\nIn a career at Bloomberg, you will play a vital role in making it all happen. You will be joining a team of solution-finders, with a real passion for providing superb customer service in a fast-paced environment. Exciting. Surprising. Purposeful. Life at Bloomberg is many things, but it is never dull. We are a truly global business with a truly diverse workforce. We pride ourselves on being open, inclusive and collaborative — and in providing a work environment that encourages our employees to be their best.\nWhat’s The Role?Are you passionate about working in financial markets and by the prospect of providing technical support for the world's leading financial professionals? If so, join the Bloomberg Customer Support team, which is a key part of our User Support business.\nAs a Bloomberg Customer Support professional, you have two critical focus areas: to provide superb customer service to a broad range of clients, and ensure the fast and effective management of various client workflows and hardware/software issues.\nYou will be responsible for the installation and setup of Bloomberg software, license, and logins, configuration of proprietary hardware (such as biometric authentication device and keyboards), and other technical & login support for our mobile and desktop applications, over the phone, email and via Bloomberg Instant Messaging. We also conduct proactive outreach to clients for licenses, hardware, and software setups, to ensure our clients are able to access our products promptly, seamlessly and securely. You will also be collaborating with internal teams at different levels and across regions to resolve complex issues while maintaining effective communication and ensuring consistent adherence to company standard.\nSecondly, you will connect with our clients, including CEOs and executive managers with access to proprietary data and information, and provide them with technical training on the Bloomberg Terminal, as well as connect them to various internal teams depending on the Bloomberg products and platforms they subscribe to. You will have the opportunity to work as part of our 500 strong distributed team, supporting our clients collectively in more than 15 languages.\n\nWho you are:You come to work with a purpose, understand the fast paced environment our clients work in, are curious and take pride in being customer service driven.\nWhat's in it for you?We provide all new hires an 8 week long training program, which covers aspects such as an introduction to Bloomberg products and services, our clients, a broader insight into global financial markets, general daily inquiries, product setup and hardware, and troubleshooting.\nYou'll never stop learning...we'll invest in your career, and coupled with our unrivaled approach to career development, we will help you expand your skills and opportunities in this role through project involvements. Our Bloomberg Technology Client Services specialists have the opportunity to be involved in mentoring, recruiting, quality control and idea generation.\nYou will have the opportunity to champion your career across the company. Our alumni have a diversity of successful career paths to: Analytics & Sales, Data, Technical Support, Finance, Enterprise Services and Corporate Admins.\nYou’ll need to have:Bachelor's degree or equivalent experienceFluency in Japanese and English (written and verbal)Ability to provide outstanding customer service to clients through live, interactive media (e.g. phone, messaging, etc.)A demonstrated interest in Finance and / or TechnologyDesire to develop skills and experience in customer service in a fast-moving FinTech environmentWillingness to learn new technologies and ability to retain informationCareful attention to detail, with an aptitude for working quickly and accuratelyMulti-tasking and problem solving skills as well as an ability to work independently and as part of a larger global teamAn interest in progressing a career within Bloomberg\nWe’d love to see:Work experience in a client/customer facing roleCuriosity to identify, research, and resolve customer technology, software and hardware issuesAwareness of data management, privacy and information securityAptitude to work within highly connected and software-based systems\nYou'll need to be able to:Start full time work in 2025 (June, August or December class)Occasionally work weekends or on a bank holiday (weekday off in lieu)\nIf this sounds like you:Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at this: https://www.bloomberg.com/company/\nPlease note this is a two stage application process. Following the submission of your main application, you will receive an email with directions to complete an online assessment. Completing this assessment is a necessary step to be considered for the role.\n\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=7495&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759230-3",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 Bloomberg Customer Support Representative (Korean Speaker) - Hong Kong",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/BCS-2025-Hong-Kong-Graduate-Korean-Speaker-Req/12766",
    "role-name": "2025 Bloomberg Customer Support Representative (Korean Speaker) - Hong Kong",
    "role-location": "Hong Kong",
    "role-description": "2025 Bloomberg Customer Support Representative (Korean Speaker) - Hong Kong\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            Hong Kong\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Technology Support\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10044593\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Company:\nBloomberg ignites the power of information and technology to bring clarity to a sophisticated world. A global financial information and news leader that provides influential decision makers a critical edge by connecting them to a dynamic network of information, people and ideas. The company delivers data, news and analytics through innovative technology and provides real time financial information to more than 325,000 subscribers globally.\nIn a career at Bloomberg, you will play a vital role in making it all happen. You will be joining a team of solution-finders, with a real passion for providing superb customer service in a fast-paced environment. Exciting. Surprising. Purposeful. Life at Bloomberg is many things, but it is never dull. We are a truly global business with a truly diverse workforce. We pride ourselves on being open, inclusive and collaborative — and in providing a work environment that encourages our employees to be their best.\nWhat’s The Role?\nAre you passionate about working in financial markets and by the prospect of providing technical support for the world's leading financial professionals? If so, join the Bloomberg Customer Support team, which is a key part of our User Support business.\nAs a Bloomberg Customer Support professional, you have two critical focus areas: to provide excellent customer service to a broad range of clients, and ensure fast and effective management of various client workflows and Bloomberg terminal-related hardware/software issues.\nYou will be responsible for the installation and setup of Bloomberg software, license, and logins, configuration of proprietary hardware (such as biometric authentication device and keyboards), and other technical & login support for our mobile and desktop applications, over the phone, email and via Bloomberg Instant Messaging. We also conduct proactive outreach to clients for licenses, hardware, and software setups, to ensure our clients are able to access our products promptly, seamlessly and securely. You will also be collaborating with internal teams at different levels and across regions to resolve complex issues while maintaining effective communication and ensuring consistent adherence to company standard.\nSecondly, you will connect with our clients, including CEOs and executive managers with access to proprietary data and information, and provide them with technical training on the Bloomberg Terminal, as well as connect them to various internal teams depending on the Bloomberg products and platforms they subscribe to. You will have the opportunity to work as part of our 500 strong distributed team, supporting our clients collectively in more than 15 languages.\nWho you are:\nYou come to work with a purpose, understand the fast paced environment our clients work in, are curious and take pride in being customer service driven.\nWhat's in it for you?\nWe provide all new hires an 8 week long training program, which covers aspects such as an introduction to Bloomberg products and services, our clients, a broader insight into global financial markets, general daily inquiries, product setup and hardware, and troubleshooting.\nYou'll never stop learning...we'll invest in your career, and coupled with our unrivaled approach to career development, we will help you expand your skills and opportunities in this role through project involvements. Our Bloomberg Customer Support Representatives have the opportunity to be involved in mentoring, recruiting, quality control and idea generation.\nYou will have the opportunity to champion your career across the company. Our alumni have a diversity of successful career paths to: Analytics & Sales, Data, Technical Support, Finance, Enterprise Services and Corporate Admins.\nThis is an entry level role where you'll need to have:\n- A Bachelor’s degree (or above) and the ability to join a 2025 August training class - Business proficiency and fluency in English and Korean to manage respective clients- Ability to provide outstanding customer service to clients through live, interactive media (e.g. phone, messaging, etc.)- A demonstrable interest in financial markets or technology and aspiration to work in the financial/fintech services industry (example: course of degree or work/internship experience or extracurricular activities)- Exposure in customer support/managing stakeholders from various profile through school, work, internship or extracurricular activities- Willingness to learn new technologies and ability to retain information- Careful attention to detail, with an aptitude for working quickly and accurately- Multi-tasking and problem solving skills as well as an ability to work independently and as part of a larger global team- An interest in progressing a career within Bloomberg\nWe’d love to see:- Curiosity to identify, research, and resolve customer technology, software and hardware issues- Awareness of data management, privacy and information security- Aptitude to work within highly connected and software-based systems\nYou'll need to be able to:- Occasionally work weekends or on a bank holiday (weekday off in lieu)\nPlease note this is a two stage application process. Following the submission of your main application, you will receive an email with directions to complete an online assessment. Completing this assessment is a necessary step to be considered for the role.\nIf this sounds like you:Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at this: https://www.bloomberg.com/company/\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=12766&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759233-4",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 Bloomberg Customer Support Representative (Mandarin Speaker) - Hong Kong",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/BCS-2025-Hong-Kong-Graduate-Mandarin-Speaker-Req/12767",
    "role-name": "2025 Bloomberg Customer Support Representative (Mandarin Speaker) - Hong Kong",
    "role-location": "Hong Kong",
    "role-description": "2025 Bloomberg Customer Support Representative (Mandarin Speaker) - Hong Kong\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            Hong Kong\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Technology Support\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10044594\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Company:\nBloomberg ignites the power of information and technology to bring clarity to a sophisticated world. A global financial information and news leader that provides influential decision makers a critical edge by connecting them to a dynamic network of information, people and ideas. The company delivers data, news and analytics through innovative technology and provides real time financial information to more than 325,000 subscribers globally.\nIn a career at Bloomberg, you will play a vital role in making it all happen. You will be joining a team of solution-finders, with a real passion for providing superb customer service in a fast-paced environment. Exciting. Surprising. Purposeful. Life at Bloomberg is many things, but it is never dull. We are a truly global business with a truly diverse workforce. We pride ourselves on being open, inclusive and collaborative — and in providing a work environment that encourages our employees to be their best.\nWhat’s The Role?\nAre you passionate about working in financial markets and by the prospect of providing technical support for the world's leading financial professionals? If so, join the Bloomberg Customer Support team, which is a key part of our User Support business.\nAs a Bloomberg Customer Support professional, you have two critical focus areas: to provide excellent customer service to a broad range of clients, and ensure fast and effective management of various client workflows and Bloomberg terminal-related hardware/software issues.\nYou will be responsible for the installation and setup of Bloomberg software, license, and logins, configuration of proprietary hardware (such as biometric authentication device and keyboards), and other technical & login support for our mobile and desktop applications, over the phone, email and via Bloomberg Instant Messaging. We also conduct proactive outreach to clients for licenses, hardware, and software setups, to ensure our clients are able to access our products promptly, seamlessly and securely. You will also be collaborating with internal teams at different levels and across regions to resolve complex issues while maintaining effective communication and ensuring consistent adherence to company standard.\nSecondly, you will connect with our clients, including CEOs and executive managers with access to proprietary data and information, and provide them with technical training on the Bloomberg Terminal, as well as connect them to various internal teams depending on the Bloomberg products and platforms they subscribe to. You will have the opportunity to work as part of our 500 strong distributed team, supporting our clients collectively in more than 15 languages.\nWho you are:\nYou come to work with a purpose, understand the fast paced environment our clients work in, are curious and take pride in being customer service driven.\nWhat's in it for you?\nWe provide all new hires an 8 week long training program, which covers aspects such as an introduction to Bloomberg products and services, our clients, a broader insight into global financial markets, general daily inquiries, product setup and hardware, and troubleshooting.\nYou'll never stop learning...we'll invest in your career, and coupled with our unrivaled approach to career development, we will help you expand your skills and opportunities in this role through project involvements. Our Bloomberg Customer Support Representatives have the opportunity to be involved in mentoring, recruiting, quality control and idea generation.\nYou will have the opportunity to champion your career across the company. Our alumni have a diversity of successful career paths to: Analytics & Sales, Data, Technical Support, Finance, Enterprise Services and Corporate Admins.\nThis is an entry level role where you'll need to have:\n- A Bachelor’s degree (or above) and the ability to join a 2025 August training class - Business proficiency and fluency in English and Mandarin to manage respective clients- Ability to provide outstanding customer service to clients through live, interactive media (e.g. phone, messaging, etc.)- A demonstrable interest in financial markets or technology and aspiration to work in the financial/fintech services industry (example: course of degree or work/internship experience or extracurricular activities)- Exposure in customer support/managing stakeholders from various profile through school, work, internship or extracurricular activities- Willingness to learn new technologies and ability to retain information- Careful attention to detail, with an aptitude for working quickly and accurately- Multi-tasking and problem solving skills as well as an ability to work independently and as part of a larger global team- An interest in progressing a career within Bloomberg\nWe’d love to see:- Curiosity to identify, research, and resolve customer technology, software and hardware issues- Awareness of data management, privacy and information security- Aptitude to work within highly connected and software-based systems\nYou'll need to be able to:- Occasionally work weekends or on a bank holiday (weekday off in lieu)\nPlease note this is a two stage application process. Following the submission of your main application, you will receive an email with directions to complete an online assessment. Completing this assessment is a necessary step to be considered for the role.\nIf this sounds like you:Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at this: https://www.bloomberg.com/company/\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=12767&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759237-5",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 Analytics and Sales (Japanese speakers), Tokyo",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/2025-ADSK-TOKYO-FTE/11156",
    "role-name": "2025 Analytics and Sales (Japanese speakers), Tokyo",
    "role-location": "Tokyo",
    "role-description": "2025 Analytics and Sales (Japanese speakers), Tokyo\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            Tokyo\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Sales and Client Service\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10042989\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Analytics and Sales program is a unique opportunity to develop a comprehensive understanding of our Bloomberg products and clients in the wider context of financial markets. Following our comprehensive training program, you will apply your knowledge by assisting our clients in the Analytics department. In our Analytics business, you will provide 24/7 support for Bloomberg Professional Service users all over the world and across multiple industries. Reaching us via our Helpdesk using the 'Instant Bloomberg' chat system, clients access unparalleled customer service where we answer their questions and help them maximize the value of Bloomberg's products. On any given day we respond to over 12,000 queries in more than 15 languages. From- educating a portfolio manager on Bloomberg’s risk management solutions to helping a trader use our functionality to discover new sources of market liquidity – the variety of problems we solve is immense. Bloomberg is constantly innovating, and Analytics plays a key role in ensuring clients are educated on new products and enhancements by proactively working closely to upskill them through technology and delivering on-site training and seminars. We also work in conjunction with Sales to deliver strategic initiatives, supporting product roll-out and onboarding clients. We want to ensure our clients are making the most of our service and using tools and features that allow them to work smarter. As you deepen your knowledge, you will have the opportunity to enter our sales department. In Sales, we are the face of Bloomberg for our clients. Consultative and entrepreneurial, we manage client relationships, whilst striving to continually grow our revenue by identifying new business opportunities. We spend our time with our clients, understanding their business goals and outpacing their expectations. Guided by curiosity and purpose, we work to understand their workflows and present them with the most appropriate solutions across our range of enterprise offerings.  What’s in it for you? You will start by completing our comprehensive Analytics & Sales training program, covering all aspects of the financial markets: industry principles, market players and asset classes - while teaching you all there is to know about the functionality and analytical tools Bloomberg has to offer! You will join one of our Analytics teams, delivering exceptional customer support to our clients by providing fast and accurate solutions to their queries, while continuing to develop your knowledge through asset class and workflow specialist training. There are multiple opportunities to further your career across the department or the company, with most Analytics representatives progressing towards opportunities in Sales. You may also develop into a specialized support role in our Advanced Team and in time take on a leadership role.   Who you are? You understand the drivers behind market moving stories and events. You are a solution-finder, with a real passion for providing exceptional customer service in a fast-paced environment and a desire to build a career in a client-facing role, you understand the importance of credibility and building relationships!   You’ll need to have:A Bachelor’s degree (or above) or relevant work experienceDemonstrated interest in the financial markets and the aspiration to work in the financial services industry Strong multitasking abilities, critical thinking and problem-solving skills The ability to learn and adapt quickly in a fast-paced dynamic environment Ambition for a client-facing career with focus on relationship management and sales Interest in innovative technologies and their potential to enhance workflows and efficiencies Exceptional communication skills (both written and verbal) Fluency in Japanese, in addition to English (written and verbal) Able to start a full-time role in 2025 Flexibility to occasionally work weekends or on bank/public/federal holiday (weekday off in lieu) \nWe’d love to see: Demonstrated practical exposure to Python or other coding languages preferable \nPrevious experience in client relationship management Beginner to intermediate experience with Excel and/or VBA  \nIf this sounds like you: Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at: https://www.bloomberg.com/company/. \n\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=11156&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759243-6",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 Analytics & Sales - French Speakers - August, September or November start",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/2025-Analytics-Sales-French-Speakers-UPDATED/7665",
    "role-name": "2025 Analytics & Sales - French Speakers - August, September or November start",
    "role-location": "London",
    "role-description": "2025 Analytics & Sales - French Speakers - August, September or November start\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            London\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Sales and Client Service\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10039509\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Analytics and Sales program is a unique opportunity to develop a comprehensive understanding of our Bloomberg products and clients in the wider context of financial markets. Following our comprehensive training program, you will apply your knowledge by assisting our clients in the Analytics department. \n\nIn our Analytics business, you will provide 24/7 support for Bloomberg Professional Service users all over the world and across multiple industries. Reaching us via our Helpdesk using the 'Instant Bloomberg' chat system, clients access unparalleled customer service where we answer their questions and help them maximize the value of Bloomberg's products. On any given day we respond to over 12,000 queries in more than 15 languages. From- educating a portfolio manager on Bloomberg’s risk management solutions to helping a trader use our functionality to discover new sources of market liquidity - the variety of problems we solve is immense. \n\nBloomberg is constantly innovating, and Analytics plays a key role in ensuring clients are educated on new products and enhancements by proactively working closely to upskill them through technology and delivering on-site training and seminars. We also work in conjunction with Sales to deliver strategic initiatives, supporting product roll-out and onboarding clients. We want to ensure our clients are making the most of our service and using tools and features that allow them to work smarter. \n\nAs you deepen your knowledge, you will have the opportunity to enter our sales department. In Sales, we are the face of Bloomberg for our clients. Consultative and entrepreneurial, we manage client relationships, whilst striving to continually grow our revenue by identifying new business opportunities. We spend our time with our clients, understanding their business goals and outpacing their expectations. Guided by curiosity and purpose, we work to understand their workflows and present them with the most appropriate solutions across our range of enterprise offerings. \n\nWhat’s in it for you? \n\nYou will start by completing our comprehensive Analytics & Sales training program, covering all aspects of the financial markets: industry principles, market players and asset classes - while teaching you all there is to know about the functionality and analytical tools Bloomberg has to offer! \n\nYou will join one of our Analytics teams, delivering exceptional customer support to our clients by providing fast and accurate solutions to their queries, while continuing to develop your knowledge through asset class and workflow specialist training. \n\nThere are multiple opportunities to further your career across the department or the company, with most Analytics representatives progressing towards opportunities in Sales. You may also develop into a specialized support role in our Advanced Team and in time take on a leadership role. \n\nWho you are? \n\nYou understand the drivers behind market moving stories and events. You are a solution-finder, with a real passion for providing exceptional customer service in a fast-paced environment and a desire to build a career in a client-facing role, you understand the importance of credibility and building relationships! \n\nYou’ll need to have: \n\n * A Bachelor’s degree (or above) or relevant work experience \n * Demonstrated interest in the financial markets and the aspiration to work in the financial services industry \n * Strong multitasking abilities, critical thinking and problem-solving skills \n * The ability to learn and adapt quickly in a fast-paced dynamic environment \n * Ambition for a client-facing career with focus on relationship management and sales \n * Interest in innovative technologies and their potential to enhance workflows and efficiencies \n * Exceptional communication skills (both written and verbal) \n * Fluency in French in addition to English (written and verbal)\n * Willing and able to travel around EMEA to meet the business needs of our clients \n * Able to start a full-time role in August, September or November 2025\n * Flexibility to occasionally work weekends or on bank holiday (weekday off in lieu) \n\nWe’d love to see: \n\n * Demonstrated practical exposure to Python or other coding languages preferable \n * Previous experience in client relationship management \n * Beginner to intermediate experience with Excel and/or VBA \n\nIf this sounds like you: \nApply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at: https://www.bloomberg.com/company/.\n                                         \n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=7665&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759247-7",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2026 Analytics and Sales (Japanese speakers), Tokyo",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/2026-ADSK-TO-FTE/11157",
    "role-name": "2026 Analytics and Sales (Japanese speakers), Tokyo",
    "role-location": "Tokyo",
    "role-description": "2026 Analytics and Sales (Japanese speakers), Tokyo\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            Tokyo\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Sales and Client Service\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10042990\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Analytics and Sales program is a unique opportunity to develop a comprehensive understanding of our Bloomberg products and clients in the wider context of financial markets. Following our comprehensive training program, you will apply your knowledge by assisting our clients in the Analytics department. In our Analytics business, you will provide 24/7 support for Bloomberg Professional Service users all over the world and across multiple industries. Reaching us via our Helpdesk using the 'Instant Bloomberg' chat system, clients access unparalleled customer service where we answer their questions and help them maximize the value of Bloomberg's products. On any given day we respond to over 12,000 queries in more than 15 languages. From- educating a portfolio manager on Bloomberg’s risk management solutions to helping a trader use our functionality to discover new sources of market liquidity – the variety of problems we solve is immense. Bloomberg is constantly innovating, and Analytics plays a key role in ensuring clients are educated on new products and enhancements by proactively working closely to upskill them through technology and delivering on-site training and seminars. We also work in conjunction with Sales to deliver strategic initiatives, supporting product roll-out and onboarding clients. We want to ensure our clients are making the most of our service and using tools and features that allow them to work smarter. As you deepen your knowledge, you will have the opportunity to enter our sales department. In Sales, we are the face of Bloomberg for our clients. Consultative and entrepreneurial, we manage client relationships, whilst striving to continually grow our revenue by identifying new business opportunities. We spend our time with our clients, understanding their business goals and outpacing their expectations. Guided by curiosity and purpose, we work to understand their workflows and present them with the most appropriate solutions across our range of enterprise offerings.  What’s in it for you? You will start by completing our comprehensive Analytics & Sales training program, covering all aspects of the financial markets: industry principles, market players and asset classes - while teaching you all there is to know about the functionality and analytical tools Bloomberg has to offer! You will join one of our Analytics teams, delivering exceptional customer support to our clients by providing fast and accurate solutions to their queries, while continuing to develop your knowledge through asset class and workflow specialist training. There are multiple opportunities to further your career across the department or the company, with most Analytics representatives progressing towards opportunities in Sales. You may also develop into a specialized support role in our Advanced Team and in time take on a leadership role.   Who you are? You understand the drivers behind market moving stories and events. You are a solution-finder, with a real passion for providing exceptional customer service in a fast-paced environment and a desire to build a career in a client-facing role, you understand the importance of credibility and building relationships!   You’ll need to have:A Bachelor’s degree (or above) or relevant work experienceDemonstrated interest in the financial markets and the aspiration to work in the financial services industry Strong multitasking abilities, critical thinking and problem-solving skills The ability to learn and adapt quickly in a fast-paced dynamic environment Ambition for a client-facing career with focus on relationship management and sales Interest in innovative technologies and their potential to enhance workflows and efficiencies Exceptional communication skills (both written and verbal) Fluency in Japanese, in addition to English (written and verbal) Able to start a full-time role in 2026 Flexibility to occasionally work weekends or on bank/public/federal holiday (weekday off in lieu) \nWe’d love to see: Demonstrated practical exposure to Python or other coding languages preferable \nPrevious experience in client relationship management Beginner to intermediate experience with Excel and/or VBA  \nIf this sounds like you: Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at: https://www.bloomberg.com/company/. \n\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=11157&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759250-8",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 - Analytics & Sales - New York",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/2025-Analytics-Sales-New-York/6455",
    "role-name": "2025 - Analytics & Sales - New York",
    "role-location": "New York",
    "role-description": "2025 - Analytics & Sales - New York\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            New York\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Sales and Client Service\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10038308\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Analytics and Sales program is a unique opportunity to develop a comprehensive understanding of our Bloomberg products and clients in the wider context of financial markets. Following our comprehensive training program, you will apply your knowledge by assisting our clients in the Analytics department.  In our Analytics business, you will provide 24/7 support for Bloomberg Professional Service users all over the world and across multiple industries. Reaching us via our Helpdesk using the 'Instant Bloomberg' chat system, clients access unparalleled customer service where we answer their questions and help them maximize the value of Bloomberg's products. On any given day we respond to over 12,000 queries in more than 15 languages. From- educating a portfolio manager on Bloomberg’s risk management solutions to helping a trader use our functionality to discover new sources of market liquidity – the variety of problems we solve is immense.  Bloomberg is constantly innovating, and Analytics plays a key role in ensuring clients are educated on new products and enhancements by proactively working closely to upskill them through technology and delivering on-site training and seminars. We also work in conjunction with Sales to deliver strategic initiatives, supporting product roll-out and onboarding clients. We want to ensure our clients are making the most of our service and using tools and features that allow them to work smarter.  As you deepen your knowledge, you will have the opportunity to enter our sales department. In Sales, we are the face of Bloomberg for our clients. Consultative and entrepreneurial, we manage client relationships, whilst striving to continually grow our revenue by identifying new business opportunities. We spend our time with our clients, understanding their business goals and outpacing their expectations. Guided by curiosity and purpose, we work to understand their workflows and present them with the most appropriate solutions across our range of enterprise offerings.  \nWhat’s in it for you?  You will start by completing our comprehensive Analytics & Sales training program, covering all aspects of the financial markets: industry principles, market players and asset classes - while teaching you all there is to know about the functionality and analytical tools Bloomberg has to offer!  You will join one of our Analytics teams, delivering exceptional customer support to our clients by providing fast and accurate solutions to their queries, while continuing to develop your knowledge through asset class and workflow specialist training.  There are multiple opportunities to further your career across the department or the company, with most Analytics representatives progressing towards opportunities in Sales. You may also develop into a specialized support role in our Advanced Team and in time take on a leadership role.  \nWho you are?  You understand the drivers behind market moving stories and events. You are a solution-finder, with a real passion for providing exceptional customer service in a fast-paced environment. With a desire to build a career in a client-facing role, you understand the importance of credibility and building relationships!  \nYou’ll need to have:A Bachelor’s degree (or above) or relevant work experience Demonstrated interest in the financial markets and the aspiration to work in the financial services industry Strong multitasking abilities, critical thinking and problem-solving skills The ability to learn and adapt quickly in a fast-paced dynamic environment Ambition for a client-facing career with focus on relationship management and sales Interest in innovative technologies and their potential to enhance workflows and efficiencies Exceptional communication skills (both written and verbal) Legal authorization to work full-time in the United States and will not require visa sponsorship now or in the future (U.S. citizen, U.S. permanent resident/green card holder, refugee, asylee)Willing and able to travel around the United States to meet the business needs of our clientsAble to start a full-time role in 2025 Flexibility to occasionally work weekends or on bank/public/federal holiday (weekday off in lieu)\nWe’d love to see:Demonstrated practical exposure to Python or other coding languages preferable Previous experience in client relationship management Beginner to intermediate experience with Excel and/or VBA \nIf this sounds like you:  Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at: https://www.bloomberg.com/company/.                                               \n                                                                                    \n                                    \n                                                                                                                                \n                                        \n                                        \n                                                                                            Salary Range = 84000 - 84000 USD Annually + Benefits\nThe referenced salary range is based on the Company's good faith belief at the time of posting. Actual compensation may vary based on factors such as geographic location, work experience, market conditions, education/training and skill level.\n\nWe offer one of the most comprehensive and generous benefits plans available and offer a range of total rewards that may include merit increases, incentive compensation (exempt roles only), paid holidays, paid time off, medical, dental, vision, short and long term disability benefits, 401(k) +match, life insurance, and various wellness programs, among others. The Company does not provide benefits directly to contingent workers/contractors and interns.\n                                                                                    \n                                    \n                                                                                                                                                                                                                                                                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=6455&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759254-9",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 Analytics & Sales - Japanese Speakers",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/2025-Analytics-Sales-Japanese-Speakers-London/12384",
    "role-name": "2025 Analytics & Sales - Japanese Speakers",
    "role-location": "London",
    "role-description": "2025 Analytics & Sales - Japanese Speakers\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            London\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Sales and Client Service\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10044215\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Analytics and Sales program is a unique opportunity to develop a comprehensive understanding of our Bloomberg products and clients in the wider context of financial markets. Following our comprehensive training program, you will apply your knowledge by assisting our clients in the Analytics department. In our Analytics business, you will provide 24/7 support for Bloomberg Professional Service users all over the world and across multiple industries. Reaching us via our Helpdesk using the 'Instant Bloomberg' chat system, clients access unparalleled customer service where we answer their questions and help them maximize the value of Bloomberg's products. On any given day we respond to over 12,000 queries in more than 15 languages. From- educating a portfolio manager on Bloomberg’s risk management solutions to helping a trader use our functionality to discover new sources of market liquidity – the variety of problems we solve is immense. Bloomberg is constantly innovating, and Analytics plays a key role in ensuring clients are educated on new products and enhancements by proactively working closely to upskill them through technology and delivering on-site training and seminars. We also work in conjunction with Sales to deliver strategic initiatives, supporting product roll-out and onboarding clients. We want to ensure our clients are making the most of our service and using tools and features that allow them to work smarter. As you deepen your knowledge, you will have the opportunity to enter our sales department. In Sales, we are the face of Bloomberg for our clients. Consultative and entrepreneurial, we manage client relationships, whilst striving to continually grow our revenue by identifying new business opportunities. We spend our time with our clients, understanding their business goals and outpacing their expectations. Guided by curiosity and purpose, we work to understand their workflows and present them with the most appropriate solutions across our range of enterprise offerings.  What’s in it for you? You will start by completing our comprehensive Analytics & Sales training program, covering all aspects of the financial markets: industry principles, market players and asset classes - while teaching you all there is to know about the functionality and analytical tools Bloomberg has to offer! You will join one of our Analytics teams, delivering exceptional customer support to our clients by providing fast and accurate solutions to their queries, while continuing to develop your knowledge through asset class and workflow specialist training. There are multiple opportunities to further your career across the department or the company, with most Analytics representatives progressing towards opportunities in Sales. You may also develop into a specialized support role in our Advanced Team and in time take on a leadership role. \nWho you are? You understand the drivers behind market moving stories and events. You are a solution-finder, with a real passion for providing exceptional customer service in a fast-paced environment. With a desire to build a career in a client-facing role, you understand the importance of credibility and building relationships!  You’ll need to have: A Bachelor’s degree (or above) or relevant work experience \nDemonstrated interest in the financial markets and the aspiration to work in the financial services industry \nStrong multitasking abilities, critical thinking and problem-solving skills \nThe ability to learn and adapt quickly in a fast-paced dynamic environment \nAmbition for a client-facing career with focus on relationship management and sales \nInterest in innovative technologies and their potential to enhance workflows and efficiencies \nA commitment to achieve the highest levels of efficiency and effectiveness Exceptional communication skills (both written and verbal)Fluency in Japanese, in addition to English (written and verbal)Willing and able to travel around EMEA to meet the business needs of our clients The ability to start full time in September or November 2025 with a valid work authorizationThe ability to occasionally work weekends or on a bank holiday (weekday off in lieu)  We’d love to see: Demonstrated practical exposure to Python or other coding languages preferable Previous experience in client relationship managementBeginner to intermediate experience with excel and/or VBA  \nIf this sounds like you: Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at: https://www.bloomberg.com/company/. \n\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=12384&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759257-10",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 Bloomberg Customer Support Representative Early Professional Program (Japanese Speaker) – Dec 2025",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/BCS-2025-Singapore-2nd-Jobber-Dec-Japanese-Speaker-Req/11364",
    "role-name": "2025 Bloomberg Customer Support Representative Early Professional Program (Japanese Speaker) – Dec 2025",
    "role-location": "Singapore",
    "role-description": "2025 Bloomberg Customer Support Representative Early Professional Program (Japanese Speaker) – Dec 2025\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            Singapore\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Technology Support\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10043197\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Company:\nBloomberg ignites the power of information and technology to bring clarity to a sophisticated world. A global financial information and news leader that provides influential decision makers a critical edge by connecting them to a dynamic network of information, people and ideas. The company delivers data, news and analytics through innovative technology and provides real time financial information to more than 325,000 subscribers globally.In a career at Bloomberg, you will play a vital role in making it all happen. You will be joining a team of solution-finders, with a real passion for providing superb customer service in a fast-paced environment. Exciting. Surprising. Purposeful. Life at Bloomberg is many things, but it is never dull. We are a truly global business with a truly diverse workforce. We pride ourselves on being open, inclusive and collaborative — and in providing a work environment that encourages our employees to be their best.\nWhat’s The Role?\n\nAre you passionate about working in financial markets and by the prospect of providing technical support for the world's leading financial professionals? If so, join the Bloomberg Customer Support team, which is a key part of our User Support business.\n\nAs a Bloomberg Customer Support professional, you have two critical focus areas: to provide excellent customer service to a broad range of clients, and ensure fast and effective management of various client workflows and Bloomberg terminal-related hardware/software issues.\nYou will be responsible for the installation and setup of Bloomberg software, license, and logins, configuration of proprietary hardware (such as biometric authentication device and keyboards), and other technical & login support for our mobile and desktop applications, over the phone, email and via Bloomberg Instant Messaging. We also conduct proactive outreach to clients for licenses, hardware, and software setups, to ensure our clients are able to access our products promptly, seamlessly and securely. You will also be collaborating with internal teams at different levels and across regions to resolve complex issues while maintaining effective communication and ensuring consistent adherence to company standard.\nSecondly, you will connect with our clients, including CEOs and executive managers with access to proprietary data and information, and provide them with technical training on the Bloomberg Terminal, as well as connect them to various internal teams depending on the Bloomberg products and platforms they subscribe to. You will have the opportunity to work as part of our 500 strong distributed team, supporting our clients collectively in more than 15 languages.\nWho you are:\nYou come to work with a purpose, understand the fast paced environment our clients work in, are curious and take pride in being customer service driven.\nWhat's in it for you?\n\nWe provide all new hires an 8 week long training program, which covers aspects such as an introduction to Bloomberg products and services, our clients, a broader insight into global financial markets, general daily inquiries, product setup and hardware, and troubleshooting.\nYou'll never stop learning...we'll invest in your career, and coupled with our unrivaled approach to career development, we will help you expand your skills and opportunities in this role through project involvements. Our Bloomberg Customer Support Representatives have the opportunity to be involved in mentoring, recruiting, quality control and idea generation.\nYou will have the opportunity to champion your career across the company. Our alumni have a diversity of successful career paths to: Analytics & Sales, Data, Technical Support, Finance, Enterprise Services and Corporate Admins.\nThis is an entry level role where you'll need to have:A minimum of a Bachelor’s degree (or above) and the ability to start in Dec 2025Up to 2 years of full-time work experienceBusiness proficiency and fluency in English and Japanese to manage respective clientsAbility to provide outstanding customer service to clients through live, interactive media (e.g. phone, messaging, etc.)A demonstrable interest in financial markets or technology and aspiration to work in the financial/fintech services industry (example: course of degree or work/internship experience or extracurricular activities)Exposure in customer support/managing stakeholders from various profile through school, work, internship or extracurricular activitiesWillingness to learn new technologies and ability to retain informationCareful attention to detail, with an aptitude for working quickly and accuratelyMulti-tasking and problem solving skills as well as an ability to work independently and as part of a larger global teamAn interest in progressing a career within BloombergWe’d love to see:Curiosity to identify, research, and resolve customer technology, software and hardware issuesAwareness of data management, privacy and information securityAptitude to work within highly connected and software-based systemsYou'll need to be able to:Occasionally work weekends or on a bank holiday (weekday off in lieu)Please note this is a two stage application process. Following the submission of your main application, you will receive an email with directions to complete an online assessment. Completing this assessment is a necessary step to be considered for the role.\nIf this sounds like you:Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at this: https://www.bloomberg.com/company/\n\nBloomberg is committed to improving the communities, cities and countries in which we work, and we support various initiatives including hiring and developing local talent. So, we may prioritise candidates with legal authorisation to work full-time in Singapore for this role, who do not require Bloomberg to sponsor their work authorization. \n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=11364&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759260-11",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2026 Bloomberg Customer Support Representative (Japanese Speaker) - Tokyo",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/2026-Bloomberg-Customer-Support-Representative-Japanese-Speaker-Tokyo/6504",
    "role-name": "2026 Bloomberg Customer Support Representative (Japanese Speaker) - Tokyo",
    "role-location": "Tokyo",
    "role-description": "2026 Bloomberg Customer Support Representative (Japanese Speaker) - Tokyo\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            Tokyo\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Technology Support\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10038357\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Company:Bloomberg ignites the power of information and technology to bring clarity to a sophisticated world. A global financial information and news leader that provides influential decision makers a critical edge by connecting them to a dynamic network of information, people and ideas. The company delivers data, news and analytics through innovative technology and provides real time financial information to more than 325,000 subscribers globally.\nIn a career at Bloomberg, you will play a vital role in making it all happen. You will be joining a team of solution-finders, with a real passion for providing superb customer service in a fast-paced environment. Exciting. Surprising. Purposeful. Life at Bloomberg is many things, but it is never dull. We are a truly global business with a truly diverse workforce. We pride ourselves on being open, inclusive and collaborative — and in providing a work environment that encourages our employees to be their best.\nWhat’s The Role?Are you passionate about working in financial markets and by the prospect of providing technical support for the world's leading financial professionals? If so, join the Bloomberg Customer Support team, which is a key part of our User Support business.\nAs a Bloomberg Customer Support professional, you have two critical focus areas: to provide superb customer service to a broad range of clients, and ensure the fast and effective management of various client workflows and hardware/software issues.\nYou will be responsible for the installation and setup of Bloomberg software, license, and logins, configuration of proprietary hardware (such as biometric authentication device and keyboards), and other technical & login support for our mobile and desktop applications, over the phone, email and via Bloomberg Instant Messaging. We also conduct proactive outreach to clients for licenses, hardware, and software setups, to ensure our clients are able to access our products promptly, seamlessly and securely. You will also be collaborating with internal teams at different levels and across regions to resolve complex issues while maintaining effective communication and ensuring consistent adherence to company standard.  \nSecondly, you will connect with our clients, including CEOs and executive managers with access to proprietary data and information, and provide them with technical training on the Bloomberg Terminal, as well as connect them to various internal teams depending on the Bloomberg products and platforms they subscribe to. You will have the opportunity to work as part of our 500 strong distributed team, supporting our clients collectively in more than 15 languages.\n\nWho you are:You come to work with a purpose, understand the fast paced environment our clients work in, are curious and take pride in being customer service driven.\nWhat's in it for you?We provide all new hires an 8 week long training program, which covers aspects such as an introduction to Bloomberg products and services, our clients, a broader insight into global financial markets, general daily inquiries, product setup and hardware, and troubleshooting.\nYou'll never stop learning...we'll invest in your career, and coupled with our unrivaled approach to career development, we will help you expand your skills and opportunities in this role through project involvements. Our Bloomberg Technology Client Services specialists have the opportunity to be involved in mentoring, recruiting, quality control and idea generation.\nYou will have the opportunity to champion your career across the company. Our alumni have a diversity of successful career paths to: Analytics & Sales, Data, Technical Support, Finance, Enterprise Services and Corporate Admins.\nYou’ll need to have:Bachelor's degree or equivalent experienceFluency in Japanese and English (written and verbal)Ability to provide outstanding customer service to clients through live, interactive media (e.g. phone, messaging, etc.)A demonstrated interest in Finance and / or TechnologyDesire to develop skills and experience in customer service in a fast-moving FinTech environmentWillingness to learn new technologies and ability to retain informationCareful attention to detail, with an aptitude for working quickly and accurately Multi-tasking and problem solving skills as well as an ability to work independently and as part of a larger global teamAn interest in progressing a career within Bloomberg\nWe’d love to see:Work experience in a client/customer facing roleCuriosity to identify, research, and resolve customer technology, software and hardware issuesAwareness of data management, privacy and information securityAptitude to work within highly connected and software-based systems\nYou'll need to be able to:Start full time work in 2026Occasionally work weekends or on a bank holiday (weekday off in lieu)\nIf this sounds like you:Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at this: https://www.bloomberg.com/company/\nPlease note this is a two stage application process. Following the submission of your main application, you will receive an email with directions to complete an online assessment. Completing this assessment is a necessary step to be considered for the role.\n\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=6504&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759264-12",
    "web-scraper-start-url": "https://bloomberg.avature.net/careers/SearchJobs/?1686=%5B55478%5D&1686_format=2312&listFilterMode=1&jobRecordsPerPage=12&_gl=1*14gxoe3*_gcl_au*NTE1NTUyNzAuMTc0Nzc1NDIzOQ..*_ga*NTcyMTc5NjE4LjE3NDc3NTQyMzk.*_ga_F61D775DS4*czE3NDc3NTQyMzkkbzEkZzEkdDE3NDc3NTQyNTEkajQ4JGwwJGgwJGRIV1JMdkN6MkZhakYyU1Z5c25MLVBucWRWN0x5SFpYZWhn#",
    "role-page": "2025 Bloomberg Customer Support Representative (Japanese Speaker) - Hong Kong",
    "role-page-href": "https://bloomberg.avature.net/careers/JobDetail/BCS-2025-Hong-Kong-Graduate-Japanese-Speaker-Req/12310",
    "role-name": "2025 Bloomberg Customer Support Representative (Japanese Speaker) - Hong Kong",
    "role-location": "Hong Kong",
    "role-description": "2025 Bloomberg Customer Support Representative (Japanese Speaker) - Hong Kong\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                        \n                    \n                        \n                                                                                                \n                                                                                    \n                                                Location\n                                            \n                                        \n                                        \n                                                                                            Hong Kong\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Business Area\n                                            \n                                        \n                                        \n                                                                                            Technology Support\n                                                                                    \n                                    \n                                                                                                                                \n                                                                                    \n                                                Ref #\n                                            \n                                        \n                                        \n                                                                                            10044142\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                    \n                        \n                        \n                        \n            \n            \n            \n                            \n                                                                        \n        \n            \n                \n                    \n                    Description & Requirements\n                \n\n                            \n\n                    \n    \n                    \n                    \n                        \n                                                                                                \n                                        \n                                        \n                                                                                            The Company:\nBloomberg ignites the power of information and technology to bring clarity to a sophisticated world. A global financial information and news leader that provides influential decision makers a critical edge by connecting them to a dynamic network of information, people and ideas. The company delivers data, news and analytics through innovative technology and provides real time financial information to more than 325,000 subscribers globally.\nIn a career at Bloomberg, you will play a vital role in making it all happen. You will be joining a team of solution-finders, with a real passion for providing superb customer service in a fast-paced environment. Exciting. Surprising. Purposeful. Life at Bloomberg is many things, but it is never dull. We are a truly global business with a truly diverse workforce. We pride ourselves on being open, inclusive and collaborative — and in providing a work environment that encourages our employees to be their best.\nWhat’s The Role?\nAre you passionate about working in financial markets and by the prospect of providing technical support for the world's leading financial professionals? If so, join the Bloomberg Customer Support team, which is a key part of our User Support business.\nAs a Bloomberg Customer Support professional, you have two critical focus areas: to provide excellent customer service to a broad range of clients, and ensure fast and effective management of various client workflows and Bloomberg terminal-related hardware/software issues.\nYou will be responsible for the installation and setup of Bloomberg software, license, and logins, configuration of proprietary hardware (such as biometric authentication device and keyboards), and other technical & login support for our mobile and desktop applications, over the phone, email and via Bloomberg Instant Messaging. We also conduct proactive outreach to clients for licenses, hardware, and software setups, to ensure our clients are able to access our products promptly, seamlessly and securely. You will also be collaborating with internal teams at different levels and across regions to resolve complex issues while maintaining effective communication and ensuring consistent adherence to company standard.\nSecondly, you will connect with our clients, including CEOs and executive managers with access to proprietary data and information, and provide them with technical training on the Bloomberg Terminal, as well as connect them to various internal teams depending on the Bloomberg products and platforms they subscribe to. You will have the opportunity to work as part of our 500 strong distributed team, supporting our clients collectively in more than 15 languages.\nWho you are:\nYou come to work with a purpose, understand the fast paced environment our clients work in, are curious and take pride in being customer service driven.\nWhat's in it for you?\nWe provide all new hires an 8 week long training program, which covers aspects such as an introduction to Bloomberg products and services, our clients, a broader insight into global financial markets, general daily inquiries, product setup and hardware, and troubleshooting.\nYou'll never stop learning...we'll invest in your career, and coupled with our unrivaled approach to career development, we will help you expand your skills and opportunities in this role through project involvements. Our Bloomberg Customer Support Representatives have the opportunity to be involved in mentoring, recruiting, quality control and idea generation.\nYou will have the opportunity to champion your career across the company. Our alumni have a diversity of successful career paths to: Analytics & Sales, Data, Technical Support, Finance, Enterprise Services and Corporate Admins.\nThis is an entry level role where you'll need to have:\n- A Bachelor’s degree (or above) and the ability to join a 2025 December training class - Business proficiency and fluency in English and Japanese to manage respective clients- Ability to provide outstanding customer service to clients through live, interactive media (e.g. phone, messaging, etc.)- A demonstrable interest in financial markets or technology and aspiration to work in the financial/fintech services industry (example: course of degree or work/internship experience or extracurricular activities)- Exposure in customer support/managing stakeholders from various profile through school, work, internship or extracurricular activities- Willingness to learn new technologies and ability to retain information- Careful attention to detail, with an aptitude for working quickly and accurately- Multi-tasking and problem solving skills as well as an ability to work independently and as part of a larger global team- An interest in progressing a career within Bloomberg\nWe’d love to see:- Curiosity to identify, research, and resolve customer technology, software and hardware issues- Awareness of data management, privacy and information security- Aptitude to work within highly connected and software-based systems\nYou'll need to be able to:- Occasionally work weekends or on a bank holiday (weekday off in lieu)\nPlease note this is a two stage application process. Following the submission of your main application, you will receive an email with directions to complete an online assessment. Completing this assessment is a necessary step to be considered for the role.\nIf this sounds like you:Apply if you think we're a good match. We'll get in touch to let you know what the next steps are, but in the meantime feel free to have a look at this: https://www.bloomberg.com/company/\n                                                                                    \n                                    \n                                                                                    \n                    \n                \n                        \n\n\n                                                                                        \n                                Apply Now\n                            \n                                                            \n                                                        \n                        \n                            \n                                Back to Job Search",
    "apply-button": "Apply Now",
    "apply-button-href": "https://bloomberg.avature.net/careers/Login?jobId=12310&source=&tags=&user=&formValues=",
    "source": "bloomberg-grads"
  },
  {
    "web-scraper-order": "1752759083-1",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/consumer-banking-graduate-scheme/",
    "title": "Consumer Banking Graduate Scheme",
    "description": "Analysing customer behaviours using cutting-edge digital and data tools to understand and improve our products and services.",
    "duration": "2 Years",
    "salary": "£42,000 + fantastic benefits",
    "Location": "This role is based across UK locations including London, the\nSouth West, West Yorkshire, North West and Edinburgh. You’ll need to be flexible. Mix office and home working with our hybrid working policy.",
    "status-text": "Applications for our Consumer Banking Graduate Scheme are currently closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759093-2",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/technology-engineering-graduate-scheme/",
    "title": "Technology Engineering Graduate Scheme",
    "description": "Sharpening your coding skills with languages like JavaScript, Java, C#, Python, Swift and Kotlin.",
    "duration": "2 Years",
    "salary": "£45,000 + fantastic benefits",
    "Location": "Edinburgh, Northwest (Manchester/Chester/Cheadle), Southwest (Bristol/Cardiff) and West Yorkshire (Leeds/Halifax). Mix office and home working with our hybrid working policy.",
    "status-text": "Applications for the Technology Engineering Graduate Scheme are now closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759102-3",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/data-science-and-analytics-graduate-scheme/",
    "title": "Data Science and Analytics Graduate Scheme",
    "description": "Design and build machine learning algorithms and cutting-edge AI solutions. Combine coding, stats, and business savvy to change the way we do things.",
    "duration": "2 Years",
    "salary": "£45,000 + fantastic benefits",
    "Location": "Edinburgh, West Yorkshire (Leeds and Halifax), North West (Chester, Cheadle, Manchester), London, South West (Bristol and Cardiff).  Mix office and home working with our hybrid working policy.",
    "status-text": "Applications for our Data Science & Analytics Graduate Scheme are currently closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759112-4",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/sustainable-financial-wellbeing-graduate-scheme/",
    "title": "Sustainable Financial Wellbeing Graduate Scheme",
    "description": "Get to know our customers and business inside out by collaborating across departments.",
    "duration": "2 Years",
    "salary": "£42,000 + fantastic benefits",
    "Location": "Edinburgh, Bristol, Leeds. Mix office and home working with our hybrid working policy.",
    "status-text": "Applications for our Sustainable Financial Wellbeing Graduate Scheme are now closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759121-5",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/corporate-banking-and-markets-graduate-scheme/",
    "title": "Corporate Banking and Markets Graduate Scheme",
    "description": "Meeting clients to understand their needs and offer tailored solutions, using data analytics for deeper insights.",
    "duration": "2 Years",
    "salary": "£45,000 + fantastic benefits",
    "Location": "Rotational Programme across key business hubs of London, Birmingham, and Edinburgh.",
    "status-text": "Applications for our Corporate Banking and Markets Graduate Scheme are currently closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759131-6",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/data-management-and-strategy-graduate-scheme/",
    "title": "Data Management and Strategy Graduate Scheme",
    "description": "Strategic thinking and problem-solving skills",
    "duration": "2 Years",
    "salary": "£42,000 + fantastic benefits",
    "Location": "Edinburgh, South West and West Yorkshire.  Mix office and home working with our hybrid working policy.",
    "status-text": "Applications for our Data Management & Strategy Graduate Scheme are currently closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759141-7",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/risk-graduate-scheme/",
    "title": "Risk Graduate Scheme",
    "description": "analyse and assess risk to forecast performance.",
    "duration": "2 Years",
    "salary": "£42,000 + fantastic benefits",
    "Location": "Leeds, Edinburgh, Bristol, Birmingham.  Mix office and home working with our hybrid working policy.",
    "status-text": "Applications for Risk Graduate Scheme are now closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759150-8",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/actuarial-graduate-scheme/",
    "title": "Actuarial Graduate Scheme",
    "description": "Coding complex insurance models.",
    "duration": "4 Years",
    "salary": "£42,000 + fantastic benefits",
    "Location": "Edinburgh, Bristol.",
    "status-text": "Applications for our Actuarial Graduate Scheme are currently closed.\nOur graduate schemes may close early if we receive a high number of applications, so it’s best to apply as soon as you can.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759160-9",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/human-resources-graduate-scheme/",
    "title": "Human Resources Graduate Scheme",
    "description": "Collaborate with HR and senior teams to craft data-driven people plans.",
    "duration": "2 Years",
    "salary": "£42,000 + fantastic benefits",
    "Location": "Bristol, Leeds, Edinburgh.  Mix office and home working with our hybrid working policy.",
    "status-text": "Applications for our Human Resources Graduate Scheme are currently closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759169-10",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/business-and-commercial-banking-graduate-scheme/",
    "title": "Business and Commercial Banking Graduate Scheme",
    "description": "Meeting clients to understand their needs and how we can support them.",
    "duration": "2 Years",
    "salary": "£45,000 + fantastic benefits",
    "Location": "Rotational Programme across key business hubs of Birmingham, Bristol, Edinburgh, Glasgow, Leeds and Manchester.",
    "status-text": "Applications for our Business & Commercial Banking Graduate Scheme are now closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759179-11",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/occupational-psychology-graduate-scheme/",
    "title": "Occupational Psychology Graduate Scheme",
    "description": "Leading the development of a people product, from early design to implementation.",
    "duration": "2 Years",
    "salary": "£42,000 + fantastic benefits",
    "Location": "Bristol or Leeds.  Mix office and home working with our hybrid working policy.",
    "status-text": "Applications for our Occupational Psychology Graduate Scheme are currently closed.",
    "source": "Lloyds-grads"
  },
  {
    "web-scraper-order": "1752759188-12",
    "web-scraper-start-url": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/",
    "programme-link": "",
    "programme-link-href": "https://www.lloydsbankinggrouptalent.com/our-opportunities/graduates/finance-graduate-scheme/",
    "title": "Finance Graduate Scheme",
    "description": "Understand the Finance function with tasks like monthly reporting and budgeting.",
    "duration": "3 Years",
    "salary": "£42,000 + fantastic benefits",
    "Location": "Leeds, Edinburgh and Bristol. Mix office and home working with our hybrid working policy.",
    "status-text": "Applications for our Finance Graduate Scheme are now closed.",
    "source": "Lloyds-grads"
  }
]